Repository: CakesTwix/translating-BookAboutBuilding
Catalog: po/*.po
Languages: uk

source: Это перенос чужого коммита к себе в репозиторий с сохранением авторства (вы указаны как человек, который перенес данный коммит), по факту очень нужная и ходовая команда. Почему? Никто не любит, когда его труды вдруг почему-то под чужим авторством. Придется вертеться с этим фактом в нашем деле. Будьте осторожны. ;)
uk: Це перенесення чужого коміту до себе в репозиторій зі збереженням авторства (ви вказані як людина, яка перенесла цей коміт), за фактом дуже потрібна і ходова команда. Чому? Ніхто не любить, коли його праці раптом чомусь під чужим авторством. Доведеться крутитися з цим фактом у нашій справі. Будьте обережні. ;)

source: Это слияние всех отсутствующих коммитов, либо из другого бранча, либо до отдельного коммита включительно в текущий бранч. Используется чтобы собрать воедино разветвленную историю.
uk: Це злиття всіх відсутніх коммітів, або з іншого бранча, або до окремого комміта включно в поточний бранч. Використовується щоб зібрати воєдино розгалужену історію.

source: Как я уже говорил, приводить я буду на примере устройства Xiaomi Redmi Note 4X Snapdragon, он же mido, также будут приведены в пример устройства Asus ZenFone 2 Laser ZE500KL/KG (Z00ED/RD или же Z00xD) и Sony Xperia Z3 Compact, потому что:
uk: Як я вже говорив, наводити я буду на прикладі пристрою Xiaomi Redmi Note 4X Snapdragon, він же mido, також будуть наведені в приклад пристрої Asus ZenFone 2 Laser ZE500KL/KG (Z00ED/RD або ж Z00xD) та Sony Xperia Z3 Compact, тому що:

source: Они у меня есть
uk: Вони у мене є

source: Я в них разбираюсь
uk: Я в них розбираюся

source: Это три устройства, у которых структура деревьев разная, что дает расширить немного кругозор
uk: Це три пристрої, структури дерева яких різні, що дозволяє трохи розширити кругозір

source: Да, сузив кругозор до трех устройств, из которых более-менее я разбираюсь только в одном, можно потерять часть информации. К сожалению, это так и как-то расширить свой же кругозор я не имею возможности. Надеюсь, кто-то заглянет и добавит недостающую информацию :)
uk: Так, звузивши кругозір до трьох пристроїв, з яких я більш-менш розбираюся тільки в одному, можна втратити частину інформації. На жаль, це так, і можливості якось розширити власний кругозір я не маю. Сподіваюся, хтось завітає і додасть інформацію, якої бракує :)

source: Параграф 1: что есть что и для чего
uk: Параграф 1: Що є що та для чого

source: И так, исходники устройства состоят обычно из:
uk: І так, вихідні коди пристрою складаються зазвичай із:

source: Device tree - дерево устройства
uk: Device tree - дерево пристроїв

source: Vendor - вендор, проприетарные библиотеки
uk: Vendor - вендор, пропрієтарні бібліотеки

source: Начнем с дерева. Дерево устройства - набор конфигурационных файлов (конфигов) разных форматов. В дереве прописываются различные пути, конфиги сборки, часто изменяющиеся конфиги, которые копируются в прошивку, исходники.
uk: Почнемо з дерева. Дерево пристрою - набір конфігураційних файлів (конфігів) різних форматів. У дереві прописуються різні шляхи, конфіги збірки, конфіги, що часто змінюються і копіюються в прошивку, вихідні коди.

source: Ядро - ядро Linux, на котором работают все Android устройства, в нем содержатся различные драйвера, переменные для них, деревья для сборки ядра и конфиги, которые говорят, что надо собирать в ядре.
uk: Ядро - ядро Linux, на якому працюють усі Android-пристрої, у ньому містяться різні драйвери, змінні для них, дерева для збірки ядра і конфіги, які говорять, що треба збирати в ядрі.

source: Вендор - набор проприетарных (уже готовых, собранные производителем или кем-либо еще) библиотек устройства, которые просто копируются в устройство. Вендор состоит из тех библиотек, исходников которых нет в открытом доступе.
uk: Вендор - набір пропрієтарних (вже готових, зібраних виробником або ким-небудь ще) бібліотек пристрою, які просто копіюються в пристрій. Вендор складається з тих бібліотек, вихідних кодів яких немає у відкритому доступі.

source: Параграф 2: что такое дерево и сколько их должно быть
uk: Параграф 2: Що таке дерево і скільки їх має бути

source: Повторим определение из введения.
uk: Повторимо визначення зі вступу.

source: Дерево устройства - набор конфигурационных файлов (конфигов) разных форматов. В дереве прописываются различные пути, конфиги сборки, часто изменяющиеся конфиги, которые копируются в прошивку, исходники.
uk: Дерево пристрою - набір конфігураційних файлів (конфігів) різних форматів. У дереві прописуються різні шляхи, конфіги збірки, конфіги, що часто змінюються і копіюються в прошивку, вихідні коди.

source: Обычно дерево лежит по пути `device/vendor/devicecodename`, где `vendor` - производитель, а `devicecodename` - кодовое имя устройства. Приведем пример для Xiaomi Redmi Note 4X - `device/xiaomi/mido`.
uk: Зазвичай дерево лежить за шляхом `device/vendor/devicecodename`, де `vendor` - виробник, а `devicecodename` - кодове ім'я пристрою. Наведемо приклад для Xiaomi Redmi Note 4X - `device/xiaomi/mido`.

source: Но бывает такое, что устройства дико похожи по составляющей дерева и одинаковую часть попросту переносят в отдельное общее дерево - common. Для примера рассмотрим Asus ZenFone 2 Laser ZE500KL/KG и Asus ZenFone Max (Z010D).
uk: Але буває таке, що пристрої шалено схожі за складовою дерева, і однакову частину просто переносять в окреме загальне дерево - common. Для прикладу розглянемо Asus ZenFone 2 Laser ZE500KL/KG і Asus ZenFone Max (Z010D).

source: Структура получается следующая - в папке `device/asus` лежат три дерева:
uk: Структура виходить така - у папці `device/asus` знаходяться три дерева:

source: Общее: msm8916-common
uk: Спільне: msm8916-common

source: Специфическое: Z00xD (объединенное дерево для Asus ZenFone 2 Laser ZE500KL и Asus ZenFone 2 Laser ZE500KG)
uk: Специфічне: Z00xD (об'єднане дерево для Asus ZenFone 2 Laser ZE500KL і Asus ZenFone 2 Laser ZE500KG)

source: Специфическое: Z010D
uk: Специфічний: Z010D

source: По итогу, вся база лежит в msm8916-common, а специфика лежит в специфичных деревьях.
uk: За підсумком, уся база лежить у msm8916-common, а специфіка лежить у специфічних деревах.

source: Ссылка на проект
uk: Посилання на проект

source: с исходниками, бранч lineage-16.0.
uk: з вихідними кодами, бранч lineage-16.0.

source: Но самое смешное, что общих деревьев может быть еще больше!
uk: Але найсмішніше, що спільних дерев може бути ще більше!

source: Приведу пример для Sony Xperia Z3 Compact:
uk: Наведу приклад для Sony Xperia Z3 Compact:

source: 4 дерева, которые друг за другом подключаются. Важно не пропустить данную информацию, иначе будет потом непонятно почему на этапе инициализации сборки произошла ошибка.
uk: 4 дерева, які одне за одним підключаються. Важливо не пропустити цю інформацію, інакше буде потім незрозуміло чому на етапі ініціалізації збірки сталася помилка.

source: Возникает все же резонный вопрос: не проще ли все-таки все в одно дерево “запихнуть” и не париться?
uk: Виникає раціональне запитання: чи не простіше все-таки все в одне дерево "запхати" і не морочитися?

source: И я скажу Вам нет. На то есть две причины:
uk: І я скажу Вам ні. На те є дві причини:

source: Если другое устройство, на которое собирается прошивка, использует общие деревья, то сокращается количество действий, которое нужно совершить для сборки (работает в том случае, если собирается прошивка не с нуля);
uk: Якщо інший пристрій, на який збирають прошивку, використовує загальні дерева, то скорочується кількість дій, які потрібно зробити для збірки (працює в тому разі, якщо збирають прошивку не з нуля);

source: Много времени и сил занимает добавление одного коммита в целый ряд устройств, проще один коммит в одно дерево, в итоге изменение будет во всех устройствах, которые используют общее дерево.
uk: Щоб додати один коміт на ряд пристроїв, потрібно багато часу і сил. Простіше додати один коміт до одного дерева, і в результаті зміна буде на всіх пристроях, які мають спільне дерево.

source: В итоге, получается только выгода. Похожую ситуацию мы увидим в вендоре.
uk: У підсумку, виходить тільки вигода. Схожу ситуацію ми побачимо у вендорі.

source: Параграф 3: Что такое vendor и почему он имеет чужие библиотеки
uk: Параграф 3: Що таке vendor і чому він має чужі бібліотеки

source: Vendor Tree (или просто vendor для сокращения, не путать с разделом) - набор проприетарных (уже готовых, собранные производителем или кем-либо еще) библиотек устройства, которые просто копируются в устройство. Vendor состоит из тех библиотек, исходников которых нет в открытом доступе. В основном там хранятся библиотеки, которые со стока (как правило специфичные для конкретной модели) и общие, которые взяты с CAF или смартфона с необходимой версией Android с таким же CPU (или из его семейства, к примеру некоторые библиотеки с msm8996 будут спокойно работать на msm8953) или просто с другой модели.
uk: Vendor Tree (або просто vendor для скорочення, не плутати з розділом) - набір пропрієтарних (вже готових, зібрані виробником або ким-небудь ще) бібліотек пристрою, які просто копіюються в пристрій. Vendor складається з тих бібліотек, вихідних кодів яких немає у відкритому доступі. Здебільшого там зберігаються бібліотеки, які зі стоку (як правило, специфічні для конкретної моделі), і загальні, які взяті з CAF або смартфона з необхідною версією Android з таким самим CPU (або з його родини, приміром, деякі бібліотеки з msm8996 будуть спокійно працювати на msm8953) або просто з іншої моделі.

source: Итак, стоковые библиотеки понятно почему лежат в vendor, они заточены под данный смартфон. А зачем все же там лежат библиотеки, которые с других устройств?
uk: Отже, стокові бібліотеки зрозуміло чому лежать у vendor, вони заточені під цей смартфон. А навіщо все ж таки там лежать бібліотеки, які з інших пристроїв?

source: Некоторые сами по себе общие, к примеру библиотеки AptX от crosshatch прекрасно чувствуют себя на mido.
uk: Деякі самі по собі загальні, наприклад бібліотеки AptX від crosshatch прекрасно почуваються на mido.

source: Некоторые заточены только под конкретный CPU/семейство CPU, тем самым на разных устройствах с таким же CPU/семейством CPU они будут работать без проблем (не всегда).
uk: Деякі заточені тільки під конкретний CPU/сімейство CPU, у такий спосіб на різних пристроях із таким самим CPU/сімейством CPU вони працюватимуть без проблем (не завжди).

source: Внезапно подошли, даже не смотря на их специфичность.
uk: Раптово підійшли, навіть попри їхню специфічність.

source: Про 3-ий пункт хотелось бы подробнее, так как здесь есть маленькая история. Ковыряя библиотеки mido мне стрельнуло попробовать что-то сделать с chromatix-библиотеками камеры. Посмотрел какие камеры у меня на моем mido и пошел смотреть модели с такими же камерами. Оказалось, что у tissot ровно такая же фронталка. Не долго думая, я быстренько сделал Magisk-модуль с этими библиотеками и… О чудо, камера работает! Воодушевившись, я попробовал еще и eeprom-библиотеку взять. Камера тоже работает! Крутяк! Далее я наткнулся на bardock, у него вроде как были библиотеки под мою основную камеру. Также сделал Magisk-модуль и… Камера работает, но все в красных тонах. Мда, грустно, но ладно, модуль удаляю и все возвращается на круги своя.
uk: Про 3-й пункт хотілося б докладніше, оскільки тут є маленька історія. Колупаючи бібліотеки mido, мені стрельнуло спробувати щось зробити з chromatix-бібліотеками камери. Подивився, які камери у мене на моєму mido і пішов дивитися моделі з такими ж камерами. Виявилося, що у tissot рівно така ж фронталка. Не довго думаючи, я швиденько зробив Magisk-модуль із цими бібліотеками і... О диво, камера працює! Надихнувшись, я спробував ще й eeprom-бібліотеку взяти. Камера теж працює! Крутяк! Далі я натрапив на bardock, у нього ніби як були бібліотеки під мою основну камеру. Також зробив Magisk-модуль і... Камера працює, але все в червоних тонах. Гм, сумно, але гаразд, модуль видаляю і все повертається на круги своя.

source: Вывод: иногда бывают случаи, что вот идеально все вписывается и работает, хотя казалось бы специфичные библиотеки с другого устройства. С этим надо быть крайне осторожным, при неизвестных последствиях можно получить неисправность устройства.
uk: Висновок: іноді бувають випадки, що ось ідеально все вписується і працює, хоча здавалося б, специфічні бібліотеки з іншого пристрою. З цим треба бути вкрай обережним, за невідомих наслідків можна отримати несправність пристрою.

source: Параграф 4: Что такое Ядро
uk: Параграф 4: Що таке Ядро

source: Что такое ядро? Ядро операционной системы - в данном случае Android - это **компонент, который помогает вашим приложениям взаимодействовать с вашим оборудованием.** Оно управляет системными ресурсами, при необходимости обменивается данными с внешними устройствами и т. д. Android использует вариант ядра Linux, содержит базовый набор драйверов, которые необходимы для работы устройства. Поскольку ядро Android по умолчанию является производным от ядра Linux, можно с уверенностью сказать, что ядро Android также является
uk: Що таке ядро? Ядро операційної системи - у даному випадку Android - це **компонент, який допомагає вашим додаткам взаємодіяти з вашим обладнанням.** Воно керує системними ресурсами, за необхідності обмінюється даними із зовнішніми пристроями тощо. Android використовує варіант ядра Linux, що містить базовий набір драйверів, які необхідні для роботи пристрою. Оскільки ядро Android за замовчуванням є похідним від ядра Linux, можна з упевненістю сказати, що ядро Android також є

source: монолитным
uk: монолітним

source: . Рассмотрим пример: предположим, вы установили приложение для съемки фотографий. Для этого вам нужно получить доступ к камере вашего телефона. Но приложение не может этого сделать. Оно не может напрямую получить доступ к камере, чтобы делать фотографии. Вместо этого оно посылает запрос ядру, и ядро предоставляет доступ к камере. Без ядра для приема и отправки информации разработчикам пришлось бы писать код для каждого отдельного события для каждого отдельного элемента ПО вашего устройства. С ядром все, что им нужно делать, это взаимодействовать с ним через API системы Android, а разработчикам нужно только заставить ПО устройства взаимодействовать с ядром.
uk: . Розглянемо приклад: припустимо, ви встановили додаток для зйомки фотографій. Для цього вам потрібно отримати доступ до камери вашого телефону. Але додаток не може цього зробити. Він не може безпосередньо отримати доступ до камери, щоб робити фотографії. Замість цього він надсилає запит ядру, і ядро надає доступ до камери. Без ядра для прийому та надсилання інформації розробникам довелося б писати код для кожної окремої події для кожного окремого елемента ПЗ вашого пристрою. З ядром все, що їм потрібно робити, це взаємодіяти з ним через API системи Android, а розробникам потрібно тільки змусити ПЗ пристрою взаємодіяти з ядром.

source: Почему ядро должно постоянно обновляться?
uk: Чому ядро має постійно оновлюватися?

source: Ядро Linux постоянно меняется. Множество улучшений попадает в ядро, чтобы сделать его более надежным, безопасным и продвинутым каждый день. Вполне логично, что вся эта дельта улучшений попадает в ядро Android при любой возможности. Многие производители сохраняют ядро неизменным при незначительном обновлении Android, в основном потому, что обновление ядра (называемое BSP - Board Support package) часто приходит от производителя чипсета (TI, Samsung, Qualcomm, Mediatek и т.д.). При изменении ядра для обновления Android, часто требуется много тестирования и обеспечения стабильности. Поэтому это часто приводит к задержке обновлений Android, а иногда и к прекращении обновлений ядра, когда поставщики чипсетов не поддерживают их. Так же это объясняет, почему производители не очень часто обновляют версию ядра вместе с версией Android.
uk: Ядро Linux постійно змінюється. Безліч поліпшень потрапляє в ядро, щоб зробити його надійнішим, безпечнішим і просунутішим щодня. Цілком логічно, що вся ця дельта поліпшень потрапляє в ядро Android за будь-якої можливості. Багато виробників зберігають ядро незмінним при незначному оновленні Android, в основному тому, що оновлення ядра (так званий BSP - Board Support package) часто надходить від виробника чіпсета (TI, Samsung, Qualcomm, Mediatek і т.д.). При зміні ядра для оновлення Android, часто потрібно багато тестування і забезпечення стабільності. Тому це часто призводить до затримки оновлень Android, а інколи й до припинення оновлень ядра, коли постачальники чипсетів не підтримують їх. Так само це пояснює, чому виробники не дуже часто оновлюють версію ядра разом із версією Android.

source: Дерево устройства (DT)
uk: Дерево пристрою (DT)

source: Дерево устройств (DT) - это структура данных, состоящая из именованных узлов и свойств, которые описывают оборудование которое, в обычных условиях, обнаружить невозможно. Операционные системы, такие как ядро Linux, используемое в Android, используют DT для поддержки широкого спектра аппаратных конфигураций, используемых в устройствах на базе Android. Производители оборудования снабжают ядро своими собственными DT, которые Linux затем компилирует в файл Device Tree Blob (DTB), используемый загрузчиком.
uk: Дерево пристроїв (DT) - це структура даних, що складається з іменованих вузлів і властивостей, які описують обладнання, яке, у звичайних умовах, виявити неможливо. Операційні системи, як-от ядро Linux, що використовується в Android, використовують DT для підтримки широкого спектра апаратних конфігурацій, що використовуються в пристроях на базі Android. Виробники обладнання постачають ядро своїми власними DT, які Linux потім компілює у файл Device Tree Blob (DTB), який використовується завантажувачем.

source: Оверлей дерева устройства (DTO) позволяет наложить центральный блок дерева устройств (DTB) на дерево устройств. Загрузчик, использующий DTO, может поддерживать DT системы-на-чипе (SoC) и динамически накладывать DT для конкретного устройства, добавляя узлы в дерево и внося изменения в свойства существующего дерева.
uk: Оверлей дерева пристрою (DTO) дає змогу накласти центральний блок дерева пристроїв (DTB) на дерево пристроїв. Завантажувач, який використовує DTO, може підтримувати DT системи-на-чіпі (SoC) і динамічно накладати DT для конкретного пристрою, додаючи вузли в дерево і вносячи зміни до властивостей наявного дерева.

source: Терминология
uk: Термінологія

source: `DT` — Дерево устройства
uk: `DT` — Дерево пристроя

source: `DTB` — Блоб дерева устройства
uk: `DTB` — Блоб дерева пристрою

source: `DTBO` — Блоб дерева устройства для оверлея
uk: `DTBO` — Блоб дерева пристрою для оверлея

source: `DTC` — Компилятор дерева устройства
uk: `DTC` — Компілятор дерева пристрою

source: `DTO` — Оверлей дерева устройства
uk: `DTO` — Оверлей дерева пристрою

source: `DTS` — Исходник дерева устройства
uk: `DTS` — Вихідний код дерева пристрою

source: `FDT` — Сплющенное дерево устройства. Двоичный формат, содержащийся в блоб-файле .dtb
uk: `FDT` — Сплющене дерево пристрою. Двійковий формат, що міститься в блоб-файлі .dtb

source: Типы ядра
uk: Типи ядра

source: **Android Common Kernel (ACK)** _Ядро, которое находится ниже ядра LTS и включает в себя исправления, представляющие интерес для сообщества Android, которые не были объединены в основные ядра Linux или ядра с длительной поддержкой (LTS). Более новые ACK (версии 5.4 и выше) также известны как ядра GKI, поскольку они поддерживают разделение кода Generic Kernel, не зависящего от аппаратного обеспечения, и модулей GKI, не зависящих от аппаратного обеспечения._
uk: **Android Common Kernel (ACK)** _Ядро, яке розташоване нижче ядра LTS і містить виправлення, що становлять інтерес для спільноти Android, які не були об'єднані в основні ядра Linux або ядра з тривалою підтримкою (LTS). Новіші ACK (версії 5.4 і вище) також відомі як ядра GKI, оскільки вони підтримують поділ коду Generic Kernel, який не залежить від апаратного забезпечення, і модулів GKI, які не залежать від апаратного забезпечення._

source: **Feature kernel** _Ядро, для которого гарантированно реализованы функции релиза платформы. Например, в Android 12 двумя функциональными ядрами были android12-5.4 и android12-5.10. Функции Android 12 не могут быть перенесены обратно на ядра 4.19 после обновления; набор функций будет аналогичен устройству, которое было запущено с 4.19 на R и обновлено до S)._
uk: **Feature kernel** _Ядро, для якого гарантовано реалізовано функції релізу платформи. Наприклад, в Android 12 двома функціональними ядрами були android12-5.4 і android12-5.10. Функції Android 12 не можуть бути перенесені назад на ядра 4.19 після оновлення; набір функцій буде аналогічним до пристрою, що був запущений із 4.19 на R та оновлений до S)._

source: **Generic Core Kernel** _Часть ядра GKI, которая является общей для всех устройств_.
uk: **Generic Core Kernel** _Частина ядра GKI, яка є спільною для всіх пристроїв_.

source: **Generic Kernel Image (GKI) kernel** _Любое более новое (5.4 и выше) ядро ACK (в настоящее время только aarch64). Это ядро состоит из двух частей: ядро GKI с общим для всех устройств кодом и модули ядра GKI, разработанные Google, которые могут быть динамически загружены на устройства, где это необходимо._
uk: **Generic Kernel Image (GKI) kernel** _Будь-яке більш нове (5.4 і вище) ядро ACK (наразі тільки aarch64). Це ядро складається з двох частин: ядро GKI із загальним для всіх пристроїв кодом і модулі ядра GKI, розроблені Google, які можуть бути динамічно завантажені на пристрої, де це необхідно._

source: **Launch Kernel** _Ядро, которое подходит для запуска устройства для данного выпуска платформы Android. Например, в Android 12 допустимыми ядрами для запуска были 4.19, 5.4 и 5.10._
uk: **Launch Kernel** _Ядро, яке підходить для запуску пристрою для цього випуску платформи Android. Наприклад, в Android 12 дійсними ядрами для запуску були 4.19, 5.4 та 5.10._

source: **Long Term Supported (LTS) kernel** _Ядро Linux, которое поддерживается от 2 до 6 лет. Ядра LTS выпускаются раз в год и являются основой для каждого из ACK Google._
uk: **Long Term Supported (LTS) kernel** _Ядро Linux, яке підтримується від 2 до 6 років. Ядра LTS випускаються раз на рік і є основою для кожного з ACK Google._

source: Типы ветвей ядра
uk: Типи гілок ядра

source: **ACK KMI kernel branch** _Ветвь, с которой собираются ядра GKI. Например, android12-5.10 и android13-5.15._
uk: **ACK KMI kernel branch** _Гілка, з якої побудовані ядра GKI. Наприклад, android12-5.10 і android13-5.15._

source: **Android-mainline** _Основная ветвь разработки для функций Android. Когда новое ядро LTS объявляется выше по течению, соответствующее новое ядро GKI ответвляется от android-mainline._
uk: **Android-mainline** _Основна гілка розробки для функцій Android. Коли нове ядро LTS оголошується вище за течією, відповідне нове ядро GKI відгалужується від основної лінії android._

source: **Linux mainline** _Основная ветвь разработки для вышестоящих ядер Linux, включая ядра LTS._
uk: **Linux mainline** _Основна гілка розробки для ядер Linux вище за течією, включаючи ядра LTS._

source: Параграф 5: Адаптация исходников устройства
uk: Параграф 5: Адаптація вихідних кодів пристрою

source: Внимание! Здесь будут общие знания и они будут касаться в основном дерева. По поводу более детальной адаптации смотрите репозиторий прошивки в поисках примеров и спрашивайте у поддержки.
uk: Увага! Тут будуть загальні знання і вони стосуватимуться переважно дерева. З приводу більш детальної адаптації дивіться репозиторій прошивки в пошуках прикладів і запитуйте у підтримки.
