Repository: CakesTwix/translating-BookAboutBuilding
Catalog: po/*.po
Languages: uk

source: Cписок частых ошибок:
uk: Список найчастіших помилок:

source: Фикс:
uk: Фікс:

source: Создаём папку по пути /mnt/ccache командой:
uk: Створюємо папку за шляхом /mnt/ccache командою:

source: Монтируем cache:
uk: Монтуємо ccache:

source: _Вместо “username” вписываете своего юзера! И не ошибитесь в пути, у вас он может быть слегка другим._
uk: _Замість «username» введіть свого користувача! І не помиліться в пути, у вас він може бути злегка іншим._

source: После монтирования прописываем команду для сжатия нашего кэша (это опционально, если вы хотите впихнуть больше в мелкий объём как я, то пишем):
uk: Після монтування прописуємо команду для стиснення нашого кешу (це опціонально, якщо ви хочете впихнути більше в малий об'єм як я, то пишемо):

source: Делаем стандартный экспорт и т.д.:
uk: Ми робимо стандартний експорт і т.д.:

source: Устанавливаем размер нашего кэша:
uk: Встановлюємо розмір нашого кешу:

source: _15G - Размер кэша в ГБ_
uk: _15G - Розмір кешу в ГБ_

source: 5.1. **Такое решение работает до первой перезагрузки.** Для повторного исправления (после каждого ребута), просто прописываете команду монтирования:
uk: 5.1. **Таке рішення працює до першого перезавантаження.** Для повторного виправлення (після кожного ребуту), просто прописуєте команду монтування:

source: Либо добавляем наш ccache в fstab:
uk: Або додаємо наш ccache у fstab:

source: 6.1. И добавляем строку: `/home/username/ccache /mnt/ccache none defaults,bind,users,noauto 0 0`
uk: 6.1 І додаємо рядок: `/home/username/ccache /mnt/ccache none defaults,bind,users,noauto 0 0`

source: После чего редактируем файл профиля:
uk: Після цього відредагуємо файл профілю:

source: 7.1. Добавив строку: `bash mount /mnt/ccache `
uk: 7.1. Додавши рядок: `bash mount /mnt/ccache `

source: `Симптомы: Сборка останавливается с ошибкой об нехватке ОЗУ на этапе сборки Metalava, либо надолго зависает`
uk: `Симптоми: Збірка зупиняється з помилкою про брак ОЗП на етапі збірки Metalava, або надовго зависає`

source: **Android 10** _(возможно устарело)_
uk: **Android 10**_(ймовірно, застарілий)_

source: Заходим в папку build/soong:
uk: Заходимо в папку build/soong:

source: Открываем на Lineage OS Gerrit нужный нам
uk: Відкриваємо на Lineage OS Gerrit потрібний нам

source: коммит
uk: комміт

source: Нажимаем кнопку “`DOWNLOAD`”
uk: Натискаємо кнопку "`DOWNLOAD`"

source: Напротив варианта “`Cherry Pick`” нажимаем кнопку копирования
uk: Навпроти варіанту "`Cherry Pick`" натискаємо кнопку копіювання

source: Копируем в терминал и нажимаем Enter
uk: Скопіюйте в термінал і натисніть Enter

source: Возвращаемся в корень исходников:
uk: Повертаємося в корінь вихідних текстів:

source: Выполняем все подготовительные команды для сборки, но не запускаем
uk: Виконуємо всі підготовчі команди для збірки, але не запускаємо

source: Заранее и отдельно собираем по одному компоненту, который требует много ОЗУ:
uk: Збираємо заздалегідь і окремо один компонент, який вимагає багато оперативної пам'яті:

source: Запускаем сборку прошивки
uk: Запускаємо збірку прошивки

source: Для него все тоже самое, отличие только в
uk: У нього все однаково, різниця лише

source: коммите
uk: комміте

source: и какие компоненты собираем заранее.
uk: і які компоненти збираємо заздалегідь.

source: ​ Убрать русские буквы в пути. Не должно быть по типу /home/coolgirl/прошивочка/…
uk: ​ Прибрати латинські літери в шляху. Не повинно бути на кшталт /home/coolgirl/прошивочка/…

source: Список полезных утилит и приложений
uk: Список корисних утиліт і додатків

source: - GUI клиент GitHub для быстрого редактирования репозитория, отсутствуют некоторые важные функции, поэтому работать с консолью все равно придётся
uk: - GUI Клієнт GitHub для швидкого редагування репозиторію, деякі важливі функції відсутні, тому вам все одно доведеться працювати з консоллю

source: - GUI git клиент
uk: - GUI git кліент

source: Midnight Commander - консольный файловый менеджер, пакет `mc`
uk: Midnight Commander - консольний файловий менеджер, пакет `mc`

source: - программа для сравнения файлов, пакет `meld`
uk: - програма порівняння файлів, пакет `meld`

source: nano - консольный текстовый редактор
uk: nano - консольний текстовий редактор

source: sed - потоковый текстовый редактор
uk: sed - потоковий текстовий редактор

source: Параграф 1 выбор подходящей системы
uk: Параграф 1: Вибір підходящої системи

source: Параграф 2 установка системы и настройка её среды
uk: Параграф 2: Встановлення системи та налаштування її середовища

source: Параграф 3 качаем исходники прошивки
uk: Параграф 3: Скачуємо вихідні коди прошивки

source: Параграф 4 исходники устройства
uk: Параграф 4: Вихідні коди пристрою

source: Параграф 5 инициализация и сборка
uk: Параграф 5: Ініціалізація та збірка

source: Параграф 6 в завершение
uk: Параграф 6: На завершення

source: # Параграф 1: выбор подходящей системы
uk: # Параграф 1: Вибір підходящої системи

source: ### Что такое Linux, и с чем его едят
uk: ### Що таке Linux, і з чим його їдять

source: #### Почему же нельзя заниматься этим на всем привычной ОС, Windows?
uk: #### Чому ж не можна займатися цим на всім звичній ОС Windows?

source: ### Ну что ж, приступим?
uk: ### Отже, давайте почнемо?

source: Большинство дистрибутивов разделяются на 2 лагеря:
uk: Більшість дистрибутивів поділяються на 2 табори:

source: Как следует из названия, основой для всех Debian-like дистрибутивов является дистрибутив Debian, а основой Arch-like - Arch Linux
uk: Як зрозуміло з назви, основою для всіх Debian-like дистрибутивів є дистрибутив Debian, а основою Arch-like - Arch Linux

source: #### Самые популярные Debian-like системы
uk: #### Найпопулярніші Debian-like системи

source: - Ubuntu (https://ubuntu.com/) - Собственно, Debian (https://www.debian.org/index.ru.html) - Linux Mint (Основан на Ubuntu) (https://linuxmint.com/)
uk: - Ubuntu (https://ubuntu.com/) - Власне, Debian (https://www.debian.org/index.uk.html) - Linux Mint (Заснований на Ubuntu) (https://linuxmint.com/)

source: #### Самые популярные Arch-like системы
uk: #### Найпопулярніші Arch-like системи

source: Тут все немного не однозначно. С одной стороны, эти системы кушают меньше ОЗУ чем Debian-like, с другой стороны если ставить, то ставить Manjaro. Почему? Да потому что установка чистого Arch Linux очень, очень сложная, тем более для новичков, т. к. проводится почти полностью в ручную. Представьте ситуацию, вам дают загрузочную флешку с дистрибутивом, вы загружаетесь с нее и видите консоль с набором утилит. Все, дальше вы сами, по мануалу. Сложно, не правда-ли? А Manjaro это тот же Arch Linux со своими репозиториями и тоже прост в установке, и можно сразу работать после установки, но требует немного большей "допилки напильником" после установки. Также в Arch Linux (а соответственно и в Manjaro) существует такая прекрасная штука как AUR - репозиторий с исходными кодами пакетов. Там можно найти почти все, чего нет в обычных репозиториях.
uk: Тут все трохи заплутано. З одного боку, ці системи їдять менше оперативної пам'яті, ніж Debian-like, з іншого боку, якщо ви встановлюєте, то встановлюйте Manjaro. Чому? Так, тому що встановити чистий Arch Linux дуже і дуже складно, особливо для початківців, так як вона майже повністю ручна. Уявіть ситуацію, вам видають завантажувальну флешку з дистрибутивом, ви завантажуєтеся з неї і бачите консоль з набором утиліт. Ось і все, тоді ви самі, згідно з інструкцією. Важко, чи не так? А ще Manjaro - це той же Arch Linux з власними репо, а також простий в установці, і працювати можна відразу після установки, але вимагає трохи більше «обробки» після установки. Також в Arch Linux (і, відповідно, в Manjaro) є така чудова річ, як AUR, сховище з вихідними кодами пакетів. Там можна знайти практично все, чого немає в звичайних репах.

source: ### Хорошо, я выбрал дистрибутив. Но тут есть различные версии с различными "оболочками", что выбрать?
uk: ### Добре, я вибрав дистрибутив. Але тут є різні версії з різними середовищами, що вибрати?

source: - Gnome (начиная с Ubuntu 18.04 используется вместо фирменной оболочки Unity) - KDE Plasma (пожалуй, самая красивая и кастомизируемая оболочка) - Cinnamon (фирменная оболочка Linux Mint) - XFCE (достаточно легковесная, по умолчанию не очень красивая, но это решается установкой темы) - LXQt (еще более легковесна, по умолчанию красивее XFCE, корни растут из LXDE) - LXDE (пожалуй самая легковесная оболочка из популярных. Не красиво) - Unity (когда-то крутая оболочка, но скажем спасибо Canonical, что прекратили ее развитие)
uk: - Gnome (починаючи з Ubuntu 18.04 він використовується замість фірмової оболонки Unity) - KDE Plasma (мабуть, найкрасивіша і настроювана оболонка) - Cinnamon (фірмова оболонка Linux Mint) - XFCE (досить легкий, не дуже симпатичний за замовчуванням, але це можна вирішити, встановивши тему) - LXQt (ще легше, XFCE за замовчуванням красивіший, коріння ростуть з LXDE) - LXDE (мабуть, найлегша оболонка з популярних. Не гарна) - Unity (раніше це була крута оболонка, але давайте подякуємо Canonical за зупинку її розвитку)

source: ### Вывод
uk: ### Висновок

source: # Установка и настройка системы
uk: # Встановлення та налаштування системи

source: ### Для установки нам потребуется:
uk: ### Для встановлення нам знадобиться:

source: - Рабочий компьютер - USB флэшка - Интернет соединение
uk: - Робочий комп'ютер - USB флешка - Інтернет-з'єднання

source: ### Скачиваем дистрибутив
uk: ### Завантажуємо дистрибутив

source: > Ссылки на сайты основных дистрибутивов находятся в предыдущем параграфе
uk: > Посилання на сайти основних дистрибутивів знаходяться в попередньому параграфі

source: ### Записываем установщик на флэшку
uk: ### Записуємо інсталятор на флешку

source: Так, нам нужна утилита для записи. Подойдет Etcher или тот же Rufus, без разницы. Рассмотрим подробнее...
uk: Так, нам потрібна утиліта для запису. Підійде Etcher або той же Rufus, без різниці. Розглянемо докладніше...

source: ### Вариант с Etcher
uk: ### Варіант з Etcher

source: Открывшееся окно
uk: Вікно, що відкрилося

source: 1. Выбираем образ дистрибутива 2. Выбираем USB устройство 3. Нажимаем Flash
uk: 1. Вибираємо образ дистрибутива 2. Вибираємо USB-пристрій 3. Натискаємо Flash

source: ### Вариант с Rufus
uk: ### Варіант із Rufus

source: Скачиваем утилиту с сайта https://rufus.ie/. Запускаем...
uk: Завантажуємо утиліту з сайту https://rufus.ie/. Запускаємо...

source: 1. Выбираем устройство 2. Выбираем образ дистрибутива 3. В случае с Linux образами без разницы какой тип разделов на флешке выбирать, это имеет вес для Windows образов. Так же не имеет веса настройки файловой системы. Вот как примерно выглядит окно после настройки ![](images/6.PNG) Интересная фишка. Можно создать так называемый persist раздел прямо в утилите без заморочек. Он нужен для сохранения данных/настроек на LiveUSB 4. Нажимаем Старт **Важно!** Вас спросят о способе записи образа, так как почти все образы с Linux являются ISO-Hybrid образами. Не буду вдаваться в подробности, скажу только что нужно **обязательно выбрать "Запись в режиме DD-образ"** ![](images/7.PNG) 5. Соглашаемся с этим ![](images/8.PNG) 6. Остается только ждать... ![](images/9.PNG)
uk: 1. Вибираємо пристрій 2. Вибираємо образ дистрибутива 3. У випадку з Linux образами без різниці який тип розділів на флешці вибирати, це має значення для Windows образів. Так само не має значення налаштування файлової системи. Ось який приблизно вигляд має вікно після налаштування ![](images/6.PNG) Цікава фішка. Можна створити так званий persist розділ прямо в утиліті без мороки. Він потрібен для збереження даних/налаштувань на LiveUSB. 4. Натискаємо Старт **Важливо!** Вас запитають про спосіб запису образу, оскільки майже всі образи з Linux є ISO-Hybrid образами. Не буду вдаватися в подробиці, скажу тільки що потрібно **обов'язково вибрати "Запис у режимі DD-образ "** ![](images/7.PNG) 5. Погоджуємося з цим ![](images/8.PNG) 6. Залишається тільки чекати... ![](images/9.PNG)

source: ## Установка системы
uk: ## Встановлення системи

source: К сожалению, раскрыть данный этап подробно я не могу ввиду технических возможностей. Но в интернете очень много гайдов, и ставить ту же Ubuntu не сложнее чем Windows. Установка [Arch](https://wiki.archlinux.org/title/Installation_guide) ([GUI](https://archlinuxgui.in/tutorials.html))| [Ubuntu](https://help.ubuntu.ru/wiki/ubuntu_install)
uk: На жаль, розкрити цей етап докладно я не можу через технічні можливості. Але в інтернеті дуже багато гайдів, і ставити ту ж Ubuntu не складніше, ніж Windows. Встановлення [Arch](https://wiki.archlinux.org/title/Installation_guide) ([GUI](https://archlinuxgui.in/tutorials.html))| [Ubuntu](https://help.ubuntu.ru/wiki/ubuntu_install)

source: > Я буду очень надеяться, что мои "коллеги" дополнят этот раздел подробной инструкцией
uk: > Я буду страшенно сподіватися, що мої "колеги" доповнять цей розділ детальною інструкцією

source: ### Настройка среды
uk: ### Налаштування середовища

source: ### Установка необходимых пакетов
uk: ### Встановлення необхідних пакетів

source: ### Настройка git
uk: ### Налаштування git

source: # Параграф 3: качаем исходники прошивки
uk: # Параграф 3: Скачуємо вихідні коди прошивки

source: Отлично, теперь требуется скачать исходники прошивки. Открываем github.com/LineageOS и офигеваем, какое большое там количество всего. И все это качать? Да, но не вручную, а с помощью утилиты repo. Открываем репозиторий android либо manifest (зависит от прошивки), обычно он закреплен.
uk: Чудово, тепер потрібно завантажити вихідні коди прошивки. Відкриваємо github.com/LineageOS і офігіваємо, яка велика там кількість усього. І все це качати? Так, але не вручну, а за допомогою утиліти repo. Відкриваємо репозиторій android або manifest (залежить від прошивки), зазвичай він закріплений.

source: Пример
uk: Приклад

source: Чтобы обновить исходники, введите просто в папке с исходниками
uk: Щоб оновити вихідні коди, введіть просто в директорії з вихідними кодами

source: Где # - количество потоков. Автор обычно вручную ставит 16 потоков для быстрого скачивания. Так же существуют самые разные агрументы для этих команд, подробнее: [repo init](https://git-repo.info/en/docs/multi-repos/git-repo-init/) [repo sync](https://git-repo.info/en/docs/multi-repos/git-repo-sync/)
uk: Де # - кількість потоків. Автор зазвичай вручну ставить 16 потоків для швидкого скачування. Так само існують найрізноманітніші аргументи для цих команд, докладніше: [repo init](https://git-repo.info/en/docs/multi-repos/git-repo-init/) [repo sync](https://git-repo.info/en/docs/multi-repos/git-repo-sync/)

source: # Параграф 4: исходники устройства
uk: # Параграф 4: Вихідні коди пристрою

source: ### Устройство официально поддерживается
uk: ### Пристрій офіційно підтримується

source: Тут самое банальное. Надо только скачать проприетарные библиотеки из репозитория github.com/TheMuppets, где библиотеки раскиданы по производителям. Скажем, у нас смартфон производства Leeco. В поиске вбиваем leeco. Открываем репозиторий, копируем ссылку. Очевидно она будет выглядить так:
uk: Тут найбанальніше. Треба тільки завантажити пропрієтарні бібліотеки з репозиторію github.com/TheMuppets, де бібліотеки розкидані за виробниками. Скажімо, у нас смартфон виробництва Leeco. У пошуку вбиваємо leeco. Відкриваємо репозиторій, копіюємо посилання. Очевидно воно матиме такий вигляд:

source: - `git clone` - команда на скачивание репозитория - `https://github.com/TheMuppets/proprietary_vendor_leeco` - ссылка на репозиторий - `-b lineage-17.1` - указываем ветку, которую требуется скачать - `vendor/leeco` - путь, куда требуется скачать репозиторий
uk: - `git clone` - команда на скачування репозиторію - `https://github.com/TheMuppets/proprietary_vendor_leeco` - посилання на репозиторій - `-b lineage-17.1` - вказуємо гілку, яку потрібно завантажити - `vendor/leeco` - шлях, куди потрібно завантажити репозиторій

source: ### Устройство официально не поддерживается
uk: ### Пристрій офіційно не підтримується

source: ``` device производитель кодовое-имя ```
uk: ``` device виробник кодове-ім'я ```

source: Самое верхнее - дерево от Lineage OS, однако там дерево максимум для Lineage OS 16.0. Не подходит. Смотрим дальше. Есть дерево от Zeelog'а, у него есть дерево для Lineage OS 17.1. Отлично! Берем. Скачиваем по той же схеме, что и библиотеки в примере с устройством Leeco.
uk: Найвище - дерево від Lineage OS, однак там дерево максимум для Lineage OS 16.0. Не підходить. Дивимося далі. Є дерево від Zeelog'а, у нього є дерево для Lineage OS 17.1. Чудово! Беремо. Завантажуємо за тією ж схемою, що й бібліотеки в прикладі з пристроєм Leeco.

source: > **Примечание**. Ветка lineage-17.1-4.9 предназначена для сборки Lineage OS 17.1 с ядром 4.9. Ветка lineage-17.1 предназначена для сборки Lineage OS 17.1 с ядром 3.18.
uk: > **Примітка**. Гілка lineage-17.1-4.9 призначена для збірки Lineage OS 17.1 з ядром 4.9. Гілка lineage-17.1 призначена для збірки Lineage OS 17.1 з ядром 3.18.

source: В случае mido здесь мы видим только ядро. Искать его не надо, открываем профиль Zeelog'а и в поиск вбиваем `android_kernel_xiaomi_mido`. Уже по налаженной схеме клонируем его. Куда клонировать? Можно посмотреть в `lineage.dependencies`. Хотя Вы наверняка заметили некоторую тенденцию в названии репозиториев и куда они были клонированы. Вернемся к тому же ядру, android_**kernel_xiaomi_mido** - **kernel/xiaomi/mido**. Думаю, вопросы излишни.
uk: У випадку з mido тут ми бачимо тільки ядро. Шукати його не треба, відкриваємо профіль Zeelog'а і в пошук вбиваємо `android_kernel_xiaomi_mido`. Уже за налагодженою схемою клонуємо його. Куди клонувати? Можна подивитися в `lineage.dependencies`. Хоча Ви напевно помітили деяку тенденцію в назві репозиторіїв і куди вони були клоновані. Повернемося до того ж ядра, android_**kernel_xiaomi_mido** - **kernel/xiaomi/mido**. Думаю, питання зайві.

source: Теперь надо скачать проприетарные библиотеки. К сожалению, в `lineage.dependencies` они не прописаны. Открываем профиль Zeelog'а снова и ищем что-то типа `vendor_xiaomi`. Нашли? Отлично, клонируем в соответствующую папку из нужной ветки. Однако если Вы работаете с другим устройством, у вас может быть иначе, к примеру, репозиторий называется `proprietary_vendor_lenovo_A6020`, очевидно, что клонируем в `vendor/lenovo/A6020`. И если в `lineage.dependencies` есть еще что-то, то тоже клонируем в соответствующие папки.
uk: Тепер треба завантажити пропрієтарні бібліотеки. На жаль, в `lineage.dependencies` вони не вказані. Відкриваємо профіль Zeelog'а знову і шукаємо щось на кшталт `vendor_xiaomi`. Знайшли? Чудово, клонуємо у відповідну папку з потрібної гілки. Однак якщо Ви працюєте з іншим пристроєм, у вас може бути інакше, наприклад, репозиторій називається `proprietary_vendor_lenovo_A6020`, очевидно, що клонуємо в `vendor/lenovo/A6020`. І якщо в `lineage.dependencies` є ще щось, то також клонуємо у відповідні папки.

source: Вообще, если есть возможность, то лучше поспрашивать у других сборщиков под ВАШЕ устройство что и откуда скачать для сборки прошивки. В некоторых случаях нужно и вовсе патчить исходники прошивки. К примеру, для моего Asus Zenfone 2 Laser ZE500KL (Z00ED) требуется модифицировать HAL'ы.
uk: Взагалі, якщо є можливість, то краще розпитати в інших збірників під ВАШ пристрій, що і звідки завантажити для збірки прошивки. У деяких випадках потрібно взагалі патчити вихідні коди прошивки. Наприклад, для мого Asus Zenfone 2 Laser ZE500KL (Z00ED) потрібно модифікувати HAL'и.

source: # Параграф 5: Инициализация и сборка
uk: # Параграф 5: Ініціалізація та збірка

source: Для начала требуется настроить окружение, что происходит посредством запуска скрипта build/envsetup.sh. Тут уместна шутка "есть два типа людей":
uk: Для початку потрібно налаштувати середовище, що виконується за допомогою запуску скрипта build/envsetup.sh. Тут доречний жарт "є два типи людей":

source: 1) Сборка прошивки с использованием make и количеством потоков. Если не указывать количество потоков, то сборка будет происходить в однопоточном режиме
uk: 1) Збірка прошивки з використанням make і кількістю потоків. Якщо не вказувати кількість потоків, то збірка відбуватиметься в однопотоковому режимі

source: 2) Сборка прошивки с использованием mka, он автоматически установит нужное количество потоков для сборки
uk: 2) Збірка прошивки з використанням mka, він автоматично встановить потрібну кількість потоків для збірки

source: В чем разница? Об этом нам скажет [Mirsaid02](https://4pda.to/forum/index.php?showuser=4383879) с 4PDA:
uk: У чому різниця? Про це нам скаже [Mirsaid02](https://4pda.to/forum/index.php?showuser=4383879) з 4PDA:

source: > **mka** - лучшая команда для сборки в плане качества, т.к использует программу sched_tool, при сборке будет возникать меньше ошибок, выбирает для каждой части сборки подходящий компилятор, но при этом сборка проходит на несколько часов дольше, в зависимости от ТХ вашего ПК или ноутбука, также его называют "супер-заряженной" версией make. > > [Пост](https://4pda.to/forum/index.php?showtopic=209610&view=findpost&p=44763389)
uk: > **mka** - найкраща команда для збірки в плані якості, тому що використовує програму sched_tool, під час збірки буде виникати менше помилок, обирає для кожної частини збірки підходящий компілятор, але водночас збірка відбувається на кілька годин довше, залежно від ТХ вашого ПК або ноутбука, також її називають "супер-зарядженою" версією make. > > [Пост](https://4pda.to/forum/index.php?showtopic=209610&view=findpost&p=44763389)

source: # Параграф 6: В завершение
uk: # Параграф 6: На завершення

source: [Репозиторий книги](https://github.com/Roker2/BookAboutBuilding)
uk: [Репозиторій книги](https://github.com/Roker2/BookAboutBuilding)

source: # Введение
uk: # Вступ

source: Начнем с определения "git".
uk: Розпочнемо з визначення "git".

source: > Git - распределенная система управления версиями. > > © Wikipedia
uk: > Git - розподілена система управління версіями. > > © Wikipedia

source: По факту git позволяет создавать историю изменений и манипулировать ею, тем самым достигая возможности более быстро разбираться в проблеме, анализировать код и т. д. Без знаний git'а будет очень сложно работать с исходниками Android и в принципе в программировании, ибо инструмент ходовой и бесплатный (если Вы пользовались Mercurial'ом, то скорее всего будет просто освоить git) и очень полезный. Пренебрегать им нельзя ни в коем случае!
uk: Фактично git дає змогу створювати історію змін і маніпулювати нею, у такий спосіб досягаючи можливості швидше розбиратися в проблемі, аналізувати код тощо. Без знань git'а буде дуже складно працювати з вихідними кодами Android і в принципі в програмуванні, бо інструмент ходовий і безоплатний (якщо Ви користувалися Mercurial'ом, то скоріш за все вам легко дасться освоїти git) та дуже корисний. Нехтувати ним не можна в жодному разі!

source: 1) "codename: part_of_tree: Name" (пример: "mido: mixer_paths: Remove duplicate entries"); 2) "codename: Name" (пример: "mido: Kang tissot s5k5e8_ofilm"); 3) "part_of_tree: Name" (пример: "power: Handle Mode::LAUNCH power hints").
uk: 1) "codename: part_of_tree: Name" (приклад: "mido: mixer_paths: Remove duplicate entries"); 2) "codename: Name" (приклад: "mido: Kang tissot s5k5e8_ofilm"); 3) "part_of_tree: Name" (приклад: "power: Handle Mode::LAUNCH power hints").

source: # Параграф 1: Создание аккаунта на GitHub и настройка git под свой аккаунт
uk: # Параграф 1: Створення акаунта на GitHub і налаштування git під свій акаунт

source: #### Создаем аккаунт на GitHub
uk: #### Створюємо акаунт на GitHub
