Repository: CakesTwix/translating-BookAboutBuilding
Catalog: po/*.po
Languages: uk

source: Тут в принципе ничего сложного, просто идем на [github.com](https://github.com/), вводим почту и пароль, входим, вуаля, у нас есть аккаунт на GitHub. Здесь мы можем создавать свои репозитории, в том числе и приватные, оценить чей-то репозиторий, подписаться на обновления репозитория, подписаться на человека, искать какие-то репозитории, поставить аватарку и статус :)
uk: Тут у принципі нічого складного, просто йдемо на [github.com](https://github.com/), вводимо пошту і пароль, входимо і вуаля, у вас є акаунт на GitHub. Тут ми можемо створювати свої репозиторії, зокрема й приватні, оцінити чийсь репозиторій, підписатися на оновлення репозиторію, підписатися на людину, шукати якісь репозиторії, поставити аватарку і статус :)

source: Мой аккаунт
uk: Мій акаунт

source: [Оригинал](https://git-scm.com/book/ru/v2/%D0%92%D0%B2%D0%B5%D0%B4%D0%B5%D0%BD%D0%B8%D0%B5-%D0%9F%D0%B5%D1%80%D0%B2%D0%BE%D0%BD%D0%B0%D1%87%D0%B0%D0%BB%D1%8C%D0%BD%D0%B0%D1%8F-%D0%BD%D0%B0%D1%81%D1%82%D1%80%D0%BE%D0%B9%D0%BA%D0%B0-Git), откуда взят пример
uk: [Оригінал](https://git-scm.com/book/uk/v2/%D0%92%D1%81%D1%82%D1%83%D0%BF-%D0%9F%D0%BE%D1%87%D0%B0%D1%82%D0%BA%D0%BE%D0%B2%D0%B5-%D0%BD%D0%B0%D0%BB%D0%B0%D1%88%D1%82%D1%83%D0%B2%D0%B0%D0%BD%D0%BD%D1%8F-Git), звідки взято приклад

source: # Параграф 2: Ходовые команды git'а
uk: # Параграф 2: Ходові команди git'а

source: >```bash >git checkout branch >``` >Это переключение между бранчами.
uk: >```bash >git checkout branch >``` >Це перехід між гілками.

source: >```bash >git clone url -b branch path/to/folder >``` >Это команда для скачивания репозитория по ссылке url из ветки branch (требуется флаг -b перед названием ветки) в папку path/to/folder. Ветка и папка являются необязательными аргументами.
uk: >```bash >git clone url -b branch path/to/folder >``` >Це команда для завантаження репозиторію за посиланням url з гілки branch (потрібен прапор -b перед назвою гілки) у папку path/to/folder. Гілка і папка є необов'язковими аргументами.

source: >```bash >git remote add alias_repo_name url >``` >Это добавление кастомного имени для репозитория. Используется в последующем для скачивания данных с указанного репозитория.
uk: >````bash >git remote add alias_repo_name url >``` >Це додавання кастомного імені для репозиторію. Використовується в подальшому для скачування даних із зазначеного репозиторію.

source: >```bash >git fetch url >git fetch alias_repo_name >``` >Это скачивание данных (коммитов) с репозитория по ссылке url или с репозитория, который имеет кастомное название. Тут между этими вариантами есть разница. Если чисто по ссылке, то он скачает данные только о главной ветке и они сотрутся после скачивания данных с другой ссылки. Второй вариант скачает информацию со всех бранчей и сохранит ее. Той же командой ее можно и обновить.
uk: >```bash >git fetch url >git fetch alias_repo_name >``` >Це скачування даних (комітів) з репозиторію за посиланням url або з репозиторію, який має кастомну назву. Тут між цими варіантами є різниця. Якщо виключно за посиланням, то він завантажить дані тільки про головну гілку і вони зітруться після скачування даних з іншого посилання. Другий варіант завантажить інформацію з усіх бранчів і воно зберігатиме її. Тією ж командою її можна й оновити.

source: >```bash >git pull >``` >Это автоматизированная версия git fetch. Он загружает бранч из удаленного репозитория, а затем объединяет ее с текущим.
uk: >```bash >git pull >``` >Це автоматизована версія git fetch. Він завантажує бранч з віддаленого репозиторію, а потім об'єднує його з поточним.

source: >```bash >git push >``` >Это противоположность fetch (с некоторыми оговорками). Он позволяет вам переместить локальную ветвь в другой репозиторий, что служит удобным способом публикации коммитов.
uk: >```bash >git push >``` >Це протилежність fetch (з деякими обмовками). Він дає вам змогу перемістити локальну гілку в інший репозиторій, що слугує зручним способом публікації комітів.

source: >```bash >git cherry-pick commit_code >``` >Это перенос чужого коммита к себе в репозиторий с сохранением авторства (вы указаны как человек, который перенес данный коммит), по факту очень нужная и ходовая команда. Почему? Никто не любит, когда его труды вдруг почему-то под чужим авторством. Придется вертеться с этим фактом в нашем деле. Будьте осторожны. ;)
uk: >```bash >git cherry-pick commit_code >``` >Це перенесення чужого коміту до себе в репозиторій зі збереженням авторства (ви вказані як людина, яка перенесла цей коміт), за фактом дуже потрібна і ходова команда. Чому? Ніхто не любить, коли його праці раптом чомусь під чужим авторством. Доведеться крутитися з цим фактом у нашій справі. Будьте обережні. ;)

source: >```bash >git merge branch / commit_code >``` >Это слияние всех отсутствующих коммитов, либо из другого бранча, либо до отдельного коммита включительно в текущий бранч. Используется чтобы собрать воедино разветвленную историю.
uk: >````bash >git merge branch / commit_code >``` >Це злиття всіх відсутніх коммітів, або з іншого бранча, або до окремого комміта включно в поточний бранч. Використовується щоб зібрати воєдино розгалужену історію.

source: - Они у меня есть - Я в них разбираюсь - Это три устройства, у которых структура деревьев разная, что дает расширить немного кругозор
uk: - Вони у мене є - Я в них розбираюся - Це три пристрої, у яких структура дерев різна, що дає розширити кругозір

source: # Параграф 1: что есть что и для чего
uk: # Параграф 1: Що є що і для чого

source: - Kernel - ядро - Device tree - дерево устройства - Vendor - вендор, проприетарные библиотеки
uk: - Kernel - ядро - Device tree - дерево пристрою - Vendor - вендор, пропрієтарні бібліотеки

source: # Параграф 2: что такое дерево и сколько их должно быть
uk: # Параграф 2: Що таке дерево і скільки їх має бути

source: - Общее: msm8916-common - Специфическое: Z00xD (объединенное дерево для Asus ZenFone 2 Laser ZE500KL и Asus ZenFone 2 Laser ZE500KG) - Специфическое: Z010D
uk: - Загальне: msm8916-common - Специфічне: Z00xD (об'єднане дерево для Asus ZenFone 2 Laser ZE500KL і Asus ZenFone 2 Laser ZE500KG) - Специфічне: Z010D

source: [Ссылка на проект](https://github.com/Asus-MSM8916) с исходниками, бранч lineage-16.0.
uk: [Посилання на проєкт](https://github.com/Asus-MSM8916) з вихідними кодами, гілка lineage-16.0.

source: Возникает все же резонный вопрос: не проще ли все-таки все в одно дерево "запихнуть" и не париться?
uk: Виникає раціональне запитання: чи не простіше все-таки все в одне дерево "запхати" і не морочитися?

source: - Если другое устройство, на которое собирается прошивка, использует общие деревья, то сокращается количество действий, которое нужно совершить для сборки (работает в том случае, если собирается прошивка не с нуля); - Много времени и сил занимает добавление одного коммита в целый ряд устройств, проще один коммит в одно дерево, в итоге изменение будет во всех устройствах, которые используют общее дерево.
uk: - Якщо інший пристрій, на який збирають прошивку, використовує загальні дерева, то скорочується кількість дій, які потрібно зробити для збірки (працює в тому разі, якщо збирають прошивку не з нуля); - Багато часу і сил займає додавання одного комміта в цілу низку пристроїв, простіше додати один комміт в одне дерево, у підсумку зміна буде у всіх пристроях, які використовують загальне дерево.

source: # Параграф 3: Что такое vendor и почему он имеет чужие библиотеки
uk: # Параграф 3: Що таке vendor і чому він має чужі бібліотеки

source: 1) Некоторые сами по себе общие, к примеру библиотеки AptX от crosshatch прекрасно чувствуют себя на mido. 2) Некоторые заточены только под конкретный CPU/семейство CPU, тем самым на разных устройствах с таким же CPU/семейством CPU они будут работать без проблем (не всегда). 3) Внезапно подошли, даже не смотря на их специфичность.
uk: 1) Деякі самі по собі спільні, приміром бібліотеки AptX від crosshatch прекрасно почуваються на mido. 2) Деякі заточені тільки під конкретний CPU/родину CPU, тим самим на різних пристроях з таким самим CPU/родиною CPU вони працюватимуть без проблем (не завжди). 3) Раптово підійшли, навіть незважаючи на їхню специфічність.

source: Про 3-ий пункт хотелось бы подробнее, так как здесь есть маленькая история. Ковыряя библиотеки mido мне стрельнуло попробовать что-то сделать с chromatix-библиотеками камеры. Посмотрел какие камеры у меня на моем mido и пошел смотреть модели с такими же камерами. Оказалось, что у tissot ровно такая же фронталка. Не долго думая, я быстренько сделал Magisk-модуль с этими библиотеками и... О чудо, камера работает! Воодушевившись, я попробовал еще и eeprom-библиотеку взять. Камера тоже работает! Крутяк! Далее я наткнулся на bardock, у него вроде как были библиотеки под мою основную камеру. Также сделал Magisk-модуль и... Камера работает, но все в красных тонах. Мда, грустно, но ладно, модуль удаляю и все возвращается на круги своя.
uk: Про 3-й пункт хотілося б докладніше, оскільки тут є маленька історія. Колупаючи бібліотеки mido, мені стрельнуло спробувати щось зробити з chromatix-бібліотеками камери. Подивився, які камери у мене на моєму mido і пішов дивитися моделі з такими ж камерами. Виявилося, що у tissot рівно така ж фронталка. Не довго думаючи, я швиденько зробив Magisk-модуль із цими бібліотеками і... О диво, камера працює! Надихнувшись, я спробував ще й eeprom-бібліотеку взяти. Камера теж працює! Крутяк! Далі я натрапив на bardock, у нього ніби як були бібліотеки під мою основну камеру. Також зробив Magisk-модуль і... Камера працює, але все в червоних тонах. Гм, сумно, але гаразд, модуль видаляю і все повертається на круги своя.

source: # Параграф 4: Что такое Ядро
uk: # Параграф 4: Що таке Ядро

source: Что такое ядро? Ядро операционной системы - в данном случае Android - это **компонент, который помогает вашим приложениям взаимодействовать с вашим оборудованием.** Оно управляет системными ресурсами, при необходимости обменивается данными с внешними устройствами и т. д. Android использует вариант ядра Linux, содержит базовый набор драйверов, которые необходимы для работы устройства. Поскольку ядро Android по умолчанию является производным от ядра Linux, можно с уверенностью сказать, что ядро Android также является [монолитным](https://ru.wikipedia.org/wiki/%D0%9C%D0%BE%D0%BD%D0%BE%D0%BB%D0%B8%D1%82%D0%BD%D0%BE%D0%B5_%D1%8F%D0%B4%D1%80%D0%BE). Рассмотрим пример: предположим, вы установили приложение для съемки фотографий. Для этого вам нужно получить доступ к камере вашего телефона. Но приложение не может этого сделать. Оно не может напрямую получить доступ к камере, чтобы делать фотографии. Вместо этого оно посылает запрос ядру, и ядро предоставляет доступ к камере. Без ядра для приема и отправки информации разработчикам пришлось бы писать код для каждого отдельного события для каждого отдельного элемента ПО вашего устройства. С ядром все, что им нужно делать, это взаимодействовать с ним через API системы Android, а разработчикам нужно только заставить ПО устройства взаимодействовать с ядром.
uk: Що таке ядро? Ядро операційної системи - у даному випадку Android - це **компонент, який допомагає вашим додаткам взаємодіяти з вашим апаратним обладнанням. ** Воно керує системними ресурсами, за необхідності обмінюється даними із зовнішніми пристроями і т. д. Android використовує варіант ядра Linux, що містить базовий набір драйверів, які необхідні для роботи пристрою. Оскільки ядро Android за замовчуванням є похідним від ядра Linux, можна з упевненістю сказати, що ядро Android також є [монолітним](https://uk.wikipedia.org/wiki/%D0%9C%D0%BE%D0%BD%D0%BE%D0%BB%D1%96%D1%82%D0%BD%D0%B5_%D1%8F%D0%B4%D1%80%D0%BE). Розглянемо приклад: припустимо, ви встановили додаток для зйомки фотографій. Для цього вам потрібно отримати доступ до камери вашого телефону. Але додаток не може цього зробити. Він не може безпосередньо отримати доступ до камери, щоб робити фотографії. Замість цього він надсилає запит ядру, і ядро надає доступ до камери. Без ядра для прийому та надсилання інформації розробникам довелося б писати код для кожної окремої події і для кожного окремого елемента ПЗ вашого пристрою. З ядром все, що їм потрібно робити, це взаємодіяти з ним через API системи Android, а розробникам потрібно тільки змусити ПЗ пристрою взаємодіяти з ядром.

source: Представление наглядно
uk: Представлення наочно

source: ### Почему ядро должно постоянно обновляться?
uk: ### Чому ядро має постійно оновлюватися?

source: Ядро Linux постоянно меняется. Множество улучшений попадает в ядро, чтобы сделать его более надежным, безопасным и продвинутым каждый день. Вполне логично, что вся эта дельта улучшений попадает в ядро Android при любой возможности. Многие производители сохраняют ядро неизменным при незначительном обновлении Android, в основном потому, что обновление ядра (называемое BSP - Board Support package) часто приходит от производителя чипсета (TI, Samsung, Qualcomm, Mediatek и т.д.). При изменении ядра для обновления Android, часто требуется много тестирования и обеспечения стабильности. Поэтому это часто приводит к задержке обновлений Android, а иногда и к прекращении обновлений ядра, когда поставщики чипсетов не поддерживают их. Так же это объясняет, почему производители не очень часто обновляют версию ядра вместе с версией Android.
uk: Ядро Linux постійно змінюється. Безліч поліпшень потрапляє в ядро, щоб зробити його надійнішим, безпечнішим і сучаснішим щодня. Цілком логічно, що вся ця дельта поліпшень потрапляє в ядро Android за найменшої можливості. Багато виробників зберігають ядро незмінним при незначному оновленні Android, в основному тому, що оновлення ядра (так званий BSP - Board Support package) часто надходить від виробника чіпсета (TI, Samsung, Qualcomm, Mediatek і т.д.). При зміні ядра для оновлення Android, часто потрібно багато тестування і забезпечення стабільності. Тому це часто призводить до затримки оновлень Android, а інколи й до припинення оновлень ядра, коли постачальники чипсетів не підтримують їх. Так само це пояснює, чому виробники не дуже часто оновлюють версію ядра разом із версією Android.

source: ### Дерево устройства (DT)
uk: ### Дерево пристрою (DT)

source: #### Терминология
uk: #### Термінологія

source: * `DT` — Дерево устройства * `DTB` — Блоб дерева устройства * `DTBO` — Блоб дерева устройства для оверлея * `DTC` — Компилятор дерева устройства * `DTO` — Оверлей дерева устройства * `DTS` — Исходник дерева устройства * `FDT` — Сплющенное дерево устройства. Двоичный формат, содержащийся в блоб-файле .dtb
uk: * `DT` - Дерево пристрою * `DTTB` - Блоб дерева пристрою * `DTTBO` - Блоб дерева пристрою для оверлея * `DTC` - Компілятор дерева пристрою * `DTO` - Оверлей дерева пристрою * `DTS` - Початковий файл дерева пристрою * `FDT` - Сплющене дерево пристрою. Бінарний формат, що міститься в блоб-файлі .dtb

source: ### Типы ядра
uk: ### Типи ядра

source: - **Android Common Kernel (ACK)** *Ядро, которое находится ниже ядра LTS и включает в себя исправления, представляющие интерес для сообщества Android, которые не были объединены в основные ядра Linux или ядра с длительной поддержкой (LTS). Более новые ACK (версии 5.4 и выше) также известны как ядра GKI, поскольку они поддерживают разделение кода Generic Kernel, не зависящего от аппаратного обеспечения, и модулей GKI, не зависящих от аппаратного обеспечения.* - **Android Open Source Project (AOSP) kernel** - **Feature kernel** *Ядро, для которого гарантированно реализованы функции релиза платформы. Например, в Android 12 двумя функциональными ядрами были android12-5.4 и android12-5.10. Функции Android 12 не могут быть перенесены обратно на ядра 4.19 после обновления; набор функций будет аналогичен устройству, которое было запущено с 4.19 на R и обновлено до S).* - **Generic Core Kernel** *Часть ядра GKI, которая является общей для всех устройств*. - **Generic Kernel Image (GKI) kernel** *Любое более новое (5.4 и выше) ядро ACK (в настоящее время только aarch64). Это ядро состоит из двух частей: ядро GKI с общим для всех устройств кодом и модули ядра GKI, разработанные Google, которые могут быть динамически загружены на устройства, где это необходимо.* - **Launch Kernel** *Ядро, которое подходит для запуска устройства для данного выпуска платформы Android. Например, в Android 12 допустимыми ядрами для запуска были 4.19, 5.4 и 5.10.* - **Long Term Supported (LTS) kernel** *Ядро Linux, которое поддерживается от 2 до 6 лет. Ядра LTS выпускаются раз в год и являются основой для каждого из ACK Google.*
uk: - **Android Common Kernel (ACK)** *Ядро, яке знаходиться нижче ядра LTS і включає в себе виправлення, що представляють інтерес для спільноти Android, які не були об'єднані в основні ядра Linux або ядра з тривалою підтримкою (LTS). Новіші ACK (версії 5.4 і вище) також відомі як ядра GKI, оскільки вони підтримують поділ коду Generic Kernel, який не залежить від апаратного забезпечення, і модулів GKI, які не залежать від апаратного забезпечення.* - **Android Open Source Project (AOSP) kernel** - **Feature kernel** *Ядро, для якого гарантовано реалізовано функції релізу платформи. Наприклад, в Android 12 двома функціональними ядрами були android12-5.4 та android12-5.10. Функції Android 12 не можуть бути перенесені назад на ядра 4.19 після оновлення; набір функцій буде аналогічним до пристрою, що був запущений з 4.19 на R та оновлений до S)*. - **Generic Core Kernel** *Частина ядра GKI, яка є спільною для всіх пристроїв*. - **Generic Kernel Image (GKI) kernel** *Будь-яке новіше (5.4 і вище) ядро ACK (наразі тільки aarch64). Це ядро складається з двох частин: ядро GKI із загальним для всіх пристроїв кодом і модулі ядра GKI, розроблені Google, які можна динамічно завантажити на пристрої, де це необхідно. - **Launch Kernel** *Ядро, яке підходить для запуску пристрою для даного випуску платформи Android. Наприклад, в Android 12 допустимими ядрами для запуску були 4.19, 5.4 і 5.10.* - **Long Term Supported (LTS) kernel** *Ядро Linux, яке підтримується від 2 до 6 років. Ядра LTS випускаються раз на рік і є основою для кожного з ACK Google.*

source: #### Типы ветвей ядра
uk: #### Типи гілок ядра

source: - **ACK KMI kernel branch** *Ветвь, с которой собираются ядра GKI. Например, android12-5.10 и android13-5.15.* - **Android-mainline** *Основная ветвь разработки для функций Android. Когда новое ядро LTS объявляется выше по течению, соответствующее новое ядро GKI ответвляется от android-mainline.* - **Linux mainline** *Основная ветвь разработки для вышестоящих ядер Linux, включая ядра LTS.*
uk: - **ACK KMI kernel branch** *Вітка, з якої збираються ядра GKI. Наприклад, android12-5.10 і android13-5.15.*. - **Android-mainline** *Основна гілка розробки для функцій Android. Коли нове ядро LTS оголошується вище за течією, відповідне нове ядро GKI відгалужується від android-mainline.* - **Linux mainline** *Основна гілка розробки для вищих ядер Linux, включаючи ядра LTS.*

source: # Параграф 5: Адаптация исходников устройства
uk: # Параграф 5: Адаптація вихідних кодів пристрою

source: - `FlipFlap` (поддержка магнитных чехлов) - `Touch HAL` (поддержка кастомных фич тачскрина) - `LiveDisplay HAL` (поддержка кастомной настройки дисплея)
uk: - `FlipFlap` (підтримка магнітних чохлів) - `Touch HAL` (підтримка кастомних функцій тачскріна) - `LiveDisplay HAL` (підтримка кастомного налаштування дисплея)

source: ### Общие моменты
uk: ### Загальні моменти

source: Вспоминаем, что LideDisplay HAL и Touch HAL были благополучно удалены, поэтому удаляем эти две строчки, но надо убрать в SEPolicy еще и правила для hal_lineage_livedisplay_qti_exec и hal_lineage_touch_default_exec. Самое простое - grep'нуть все правила SEPolicy нашего дерева. Делается так:
uk: Згадуємо, що LiveDisplay HAL і Touch HAL були успішно видалені, тому видаляємо ці два рядки, але треба прибрати в SEPolicy ще й правила для hal_lineage_livedisplay_qti_exec і hal_lineage_touch_default_exec. Найпростіше - grep'нути всі правила SEPolicy нашого дерева. Робиться так:

source: Таким образом мы увидим все файлы, которые имеют включение текста "place_here*_*searched_text", надеюсь логика понятна. И так, ищем и удаляем эти правила. Если файл состоит целиком из того, что относится к искомым типам, то попросту удаляем (скорее всего так и будет). Уря! Готово!
uk: Таким чином ми побачимо всі файли, які мають включення тексту "place_here*_*searched_text", сподіваюся, логіка зрозуміла. Отже, шукаємо і видаляємо ці правила. Якщо файл складається повністю з того, що належить до типів, які ми шукаємо, то просто видаляємо його (найімовірніше, так і буде). Уря! Готово!

source: ### AOSP based -> Lineage OS based
uk: ### AOSP based -> Lineage OS basedhttps://weblate.cakestwix.com/js/ignore-check/33825/

source: ### Напоследок
uk: ### Наостанок

source: * обновлении проприетарных библиотек устройства; * патчинге проприетарных библиотек; * обновлении компонентов дерева; * работе с sepolicy; * обновлении и сборке ядра.
uk: * оновлення пропрієтарних бібліотек пристрою; * патчинг пропрієтарних бібліотек; * оновлення компонентів дерева; * робота з sepolicy; * оновлення та збірку ядра.

source: Со всем этим Вы столкнетесь в своей "карьере" сопровождающего Android-устройства. Можно задать резонный вопрос: "Зачем обновлять что-либо, если оно и так работает?" Android не стоит на месте, как и кастомные прошивки, требуется следить за новшествами и за обновлением различных специфичных компонентов вашего устройства, как ядро, дерево и библиотеки - все это постоянно или с переменным успехом обновляется. К примеру, в плане ядра Linux выходят новые версии ядер с исправлениями и улучшениями, а также CAF постоянно полирует код для своих процессоров. Если мы говорим про патчинг, то есть такая проблема, что некоторые проприетарные библиотеки крайне специфичны и их ничем подменить нельзя. Приходится их патчить, чтобы они работали с более новой версией Android.
uk: З усім цим Ви зіткнетеся у своїй "кар'єрі" супроводжуючого Android-пристроя. Можна поставити обґрунтоване запитання: "Навіщо оновлювати що-небудь, якщо воно і так працює?" Android не стоїть на місці, як і кастомні прошивки, потрібно стежити за нововведеннями і за оновленням різних специфічних компонентів вашого пристрою, як-от ядро, дерево і бібліотеки - все це постійно або зі змінним успіхом оновлюється. Наприклад, у плані ядра Linux виходять нові версії ядер з виправленнями і поліпшеннями, а також CAF постійно шліфує код для своїх процесорів. Якщо ми говоримо про патчінг, то є така проблема, що деякі пропрієтарні бібліотеки вкрай специфічні і їх нічим підмінити не можна. Доводиться їх патчити, щоб вони працювали з більш новою версією Android.

source: # Параграф 1: Дампы, vendor, proprietary-files.txt и обновление библиотек
uk: # Параграф 1: Дампи, vendor, proprietary-files.txt і оновлення бібліотек

source: ### Vendor и proprietary-files.txt
uk: ### Vendor та proprietary-files.txt

source: В деревьях вы могли видеть файлик **proprietary-files.txt**. Если вы его открывали, то видели, что это по факту список того, что лежит в vendor'е. Также подобных файлов может быть несколько. В деревьях устройств на базе процессоров Qualcomm Snapdragon часто можно было встретить **proprietary-files-qc.txt** - это список файлов для common vendor. К примеру, у mido и tissot был common vendor и в их деревьях можно было встретить proprietary-files-qc.txt.
uk: У деревах ви могли бачити файлик **proprietary-files.txt**. Якщо ви його відкривали, то бачили, що це фактично список того, що лежить у vendor'і. Таких файлів може бути кілька. У деревах пристроїв на базі процесорів Qualcomm Snapdragon часто можна було зустріти **proprietary-files-qc.txt** - це список файлів для common vendor. Наприклад, у mido і tissot був common vendor і в їхніх деревах можна було зустріти proprietary-files-qc.txt.
