Repository: CakesTwix/translating-BookAboutBuilding
Catalog: po/*.po
Languages: uk

source: Введение
uk: Вступ

source: Глава 1 Начало начал
uk: Розділ 1 Початок

source: Параграф 1 Выбор подходящей системы
uk: Параграф 1: Вибір підходящої системи

source: Параграф 2 Установка системы и настройка её среды
uk: Параграф 2: Встановлення системи та налаштування її середовища

source: Параграф 3 Качаем исходники прошивки
uk: Параграф 3: Скачуємо вихідні коди прошивки

source: Параграф 4 Исходники устройства
uk: Параграф 4: Вихідні коди пристрою

source: Параграф 5 Инициализация и сборка
uk: Параграф 5: Ініціалізація та збірка

source: Параграф 6 В завершение
uk: Параграф 6: На завершення

source: Глава 2 git, с чем его едят и зачем он
uk: Глава 2: git, з чим його їдять і навіщо він

source: Параграф 1 Создание аккаунта на GitHub и настройка git под свой аккаунт
uk: Параграф 1: Створення акаунта на GitHub, налаштування git під свій акаунт

source: Параграф 2 Ходовые команды git'а
uk: Параграф 2: Ходові команди git'у

source: Глава 3 изучение исходников устройства
uk: Розділ 3: Дослідження вихідних кодів пристрою

source: Параграф 1 что есть что и для чего
uk: Параграф 1: Що є що та для чого

source: Параграф 2 что такое дерево и сколько их должно быть
uk: Параграф 2: Що таке дерево і скільки їх має бути

source: Параграф 3 Что такое vendor и почему он имеет чужие библиотеки
uk: Параграф 3: Що таке vendor і чому він має чужі бібліотеки

source: Параграф 4 Что такое ядро
uk: Параграф 4: Що таке ядро

source: Параграф 5 Адаптация исходников устройства
uk: Параграф 5: Адаптація вихідних кодів пристрою

source: Глава 4 Обновление исходников самостоятельно
uk: Глава 4: Оновлення вихідних кодів самостійно

source: Параграф 1 Дампы, vendor и proprietary-files.txt
uk: Параграф 1: Дампи, vendor і proprietary-files.txt

source: Параграф 5 Обновление и сборка ядра
uk: Параграф 5: Оновлення та збірка ядра

source: Глава 5 дополнительный материал, который не вошел в основную часть
uk: Розділ 5: Додатковий матеріал, який не ввійшов до основної частини

source: Параграф 1 ошибки сборки (SELinux, нехватка пакетов, ресурсов и тд)
uk: Параграф 1: Помилки збірки (SELinux, нестача пакетів, ресурсів і тд)

source: Параграф 5 список полезных утилит и приложений
uk: Параграф 5: Список корисних утиліт і додатків

source: Книга представляет собой исчерпывающее руководство по сборке операционной системы Android из исходного кода на Linux и разбору ее работы на низком уровне. Написанная в доступном и понятном стиле, она предоставляет читателям уникальную возможность углубиться во внутреннюю механику Android и получить полное представление о том, как функционирует эта популярная мобильная платформа.
uk: Книга являє собою вичерпне керівництво по збірці операційної системи Android з вихідного коду на Linux і аналізу її роботи на низькому рівні. Написаний у доступному та легкому для розуміння стилі, він надає читачам унікальну можливість заглибитися у внутрішню механіку Android та отримати повне розуміння того, як функціонує ця популярна мобільна платформа.

source: Параграф 1: Выбор подходящей системы
uk: Параграф 1: Вибір підходящої системи

source: Людям, которые знают операционные системы Linux, этот параграф можно пропустить, так как, думаю, вы и без меня все знаете.
uk: Людям, які знайомі з операційними системами Linux, цей параграф можна пропустити, тому що, думаю, ви і без мене все знаєте.

source: Что такое Linux, и с чем его едят
uk: Що таке Linux, і з чим його їдять

source: Linux - это ОС с открытым исходным кодом, разрабатываемая сообществом программистовю. Ядро Linux разрабатывается независимо, а сами дистрибутивы (например, Ubuntu, Fedora, Debian) создаются на его основе и дополняются дополнительными программами и утилитами. В данной статье рассматривается выбор дистрибутива для сборки прошивки.
uk: Linux - це ОС з відкритим вихідним кодом, яку розробляє спільнота програмістів. Ядро Linux розробляється незалежно, а самі дистрибутиви (наприклад, Ubuntu, Fedora, Debian) створюють на його основі, а також доповнюють додатковими програмами та утилітами. У цій статті розглядається вибір дистрибутива для збірки прошивки.

source: Почему же нельзя заниматься этим на всем привычной ОС, Windows?
uk: Чому ж не можна займатися цим на всім звичній ОС Windows?

source: Ну, сборка на Linux считается более предпочтительной как минимум потому что многих утилит нет на Windows, а те которые есть, поставляются в крайне неудобной форме: архивы, установщики и т. д. Однако есть возможность делать это на Windows при помощи виртуальных машин, или же WSL на Windows 10.
uk: Ну, збірка на Linux вважається кращою щонайменше тому, що багатьох утиліт немає на Windows, а ті, які є, постачаються у вкрай незручній формі: архіви, інсталятори і т. д. Однак є можливість робити це на Windows за допомогою віртуальних машин, або ж WSL на Windows 10.

source: **WSL** - Windows Subsystem for Linux - Фича в Windows 10/11, позволяющая запускать Linux контейнеры прямо в Windows. Эти контейнеры можно установить из магазина приложений (Microsoft Store). Но почти все разработчики предпочитают нативный Linux, т. к. WSL может быть менее стабильным.
uk: **WSL** - Windows Subsystem for Linux - Фіча в Windows 10/11, що дає змогу запускати Linux контейнери прямо в Windows. Ці контейнери можна встановити з магазину додатків (Microsoft Store). Але майже всі розробники віддають перевагу нативному Linux, оскільки WSL може бути менш стабільним.

source: Ну что ж, приступим?
uk: Ну що ж, розпочнемо?

source: Хорошо, если вы уже решились познать новую ОС, и начать все таки собирать прошивки (и не только), то начнем выбирать дистрибутив для вас.
uk: Добре, якщо ви вже наважилися пізнати нову ОС і почати, все таки, збирати прошивки (і не тільки), тоді почнемо обирати дистрибутив для вас.

source: Большинство дистрибутивов разделяются на несколько лагерей:
uk: Більшість дистрибутивів поділяються на кілька таборів:

source: Основное различие - система управления пакетами, или **пакетный менеджер**. С этим всем мы познакомимся в следующем параграфе.
uk: Основна відмінність - система управління пакетами, або **пакетний менеджер**. Із цим усім ми познайомимося в наступному параграфі.

source: А пока, чтобы не грузить вас ненужной информацией, скажу: Debian-like системы подходят для новичков, легко освоить, шанс убить систему своими руками гораздо ниже, чем у второго лагеря, Arch-like же подходят для уже освоившихся пользователей, более сложны в настройке.
uk: А поки що, щоб не навантажувати вас непотрібною інформацією, скажу: Debian-like системи підходять для новачків, їх легко освоїти, шанс вбити систему своїми руками набагато нижчий, ніж у другого табору, Arch-like ж підходять для користувачів, які вже освоїлися, більш складні в налаштуванні.

source: Fedora Linux это что-то между Debian и Arch Linux по сложности. В Fedora довольно сложный установщик, но более кастомизируемый, чем в Debian. С коробки софта там в разы меньше, но можно подключить пользовательский репозиторий с множества софта, в том числе и проприетарного.
uk: Fedora Linux - це щось середнє між Debian та Arch Linux з точки зору складності. Fedora має досить складний інсталятор, але більш настроюється, ніж Debian. Програмного забезпечення на коробці набагато менше, але ви можете підключити користувацький репозиторій з різноманітним програмним забезпеченням, в тому числі і пропрієтарнім програмним забезпеченням.

source: Самые популярные Debian-like системы
uk: Найпопулярніші Debian-like системи

source: Собственно, Debian (https://www.debian.org/index.ru.html)
uk: Власне, Debian (https://www.debian.org/index.ru.html)

source: Linux Mint (Основан на Ubuntu) (https://linuxmint.com/)
uk: Linux Mint (на основі Ubuntu) (https://linuxmint.com/)

source: Все используют Ubuntu и вам советую. Хорошая ОС для как начала, так и для повседневного использования. От себя добавлю, что начинать нужно именно с нее, так как проста в установке, настройке, после установки можно сразу работать. Также советую Linux Mint, это та же Ubuntu, только немного с другим набором программ и в фирменной оболочке Cinnamon, которая более привычна для Windows-юзера.
uk: Усі використовують Ubuntu і вам раджу. Хороша ОС як для початку, так і для повсякденного використання. Від себе додам, що починати потрібно саме з неї, тому що вона проста в установці, налаштуванні, після установки можна відразу працювати. Також раджу Linux Mint, це та сама Ubuntu, тільки дещо з іншим набором програм і у фірмовому середовищі Cinnamon, яке більш звичне для Windows-користувача.

source: Самые популярные Arch-like системы
uk: Найпопулярніші Arch-like системи

source: Тут все немного не однозначно. С одной стороны, эти системы кушают меньше ОЗУ чем Debian-like, с другой стороны если ставить, то ставить Manjaro. Почему? Да потому что установка чистого Arch Linux очень, очень сложная, тем более для новичков, т. к. проводится почти полностью в ручную. Представьте ситуацию, вам дают загрузочную флешку с дистрибутивом, вы загружаетесь с нее и видите консоль с набором утилит. Все, дальше вы сами, по мануалу. Сложно, не правда-ли? А Manjaro это тот же Arch Linux со своими репозиториями и тоже прост в установке, и можно сразу работать после установки, но требует немного большей “допилки напильником” после установки. Также в Arch Linux (а соответственно и в Manjaro) существует такая прекрасная штука как AUR - репозиторий с исходными кодами пакетов. Там можно найти почти все, чего нет в обычных репозиториях.
uk: Тут все трохи заплутано. З одного боку, ці системи їдять менше оперативної пам'яті, ніж Debian-like, з іншого боку, якщо ви встановлюєте, то встановлюйте Manjaro. Чому? Так, тому що встановити чистий Arch Linux дуже і дуже складно, особливо для початківців, так як вона майже повністю ручна. Уявіть ситуацію, вам видають завантажувальну флешку з дистрибутивом, ви завантажуєтеся з неї і бачите консоль з набором утиліт. Ось і все, тоді ви самі, згідно з інструкцією. Важко, чи не так? А ще Manjaro - це той же Arch Linux з власними репо, а також простий в установці, і працювати можна відразу після установки, але вимагає трохи більше «обробки» після установки. Також в Arch Linux (і, відповідно, в Manjaro) є така чудова річ, як AUR, сховище з вихідними кодами пакетів. Там можна знайти практично все, чого немає в звичайних репах.

source: Самые популярные Fedora-like системы
uk: Найпопулярніші Fedora-like системи

source: Со стороны Fedora все легко, нету множества форков, в основном есть только одна ветка. Как и у Ubuntu, тут есть сборки с различными оболочками - Fedora Spins. В основную поставку Fedora Linux поставляется чистый GNOME без каких-то либо патчей от себя, но я не рекомендую использовать GNOME на слабых или когда нужны все 100% ресурсы ПК. В нашем случае нужны желательно максимум от нашего ПК, верно? Поэтому могу порекомендовать использовать более легкие DE, например LXQT, LXDE, XFCE, KDE.
uk: З боку Fedora все легко; вилок не так багато, в основному є лише одна гілка. Як і Ubuntu, існують збірки з різними оболонками - Fedora Spins. Fedora Linux поставляється з чистим GNOME без будь-яких патчів, але я не рекомендую використовувати GNOME на слабких ПК або коли вам потрібно 100% ресурсів ПК. У нашому випадку нам потрібно найбільше від нашого ПК, правда? Тому я можу рекомендувати використовувати більш легкі DE, наприклад LXQT, LXDE, XFCE, KDE.

source: Хорошо, я выбрал дистрибутив. Но тут есть различные версии с различными “оболочками”, что выбрать?
uk: Добре, я вибрав дистрибутив. Але тут є різні версії з різними середовищами, що вибрати?

source: Тут все чисто по вкусу. В каждой из оболочек есть что-то свое, какие-то легковесные, какие-то красивые. Вот список основных из них:
uk: Тут усе виключно за смаком. У кожному з середовищ є щось своє, якісь легковажні, якісь красиві. Ось список основних із них:

source: Gnome (начиная с Ubuntu 18.04 используется вместо фирменной оболочки Unity)
uk: Gnome (використовується замість фірмової оболонки Unity з Ubuntu 18.04)

source: KDE Plasma (пожалуй, самая красивая и кастомизируемая оболочка)
uk: KDE Plasma (мабуть, найкрасивіша і настроювана оболонка)

source: Cinnamon (фирменная оболочка Linux Mint)
uk: Cinnamon (фірмова оболонка Linux Mint)

source: XFCE (достаточно легковесная, по умолчанию не очень красивая, но это решается установкой темы)
uk: XFCE (досить легкий, не дуже симпатичний за замовчуванням, але це можна вирішити, встановивши тему)

source: LXQt (еще более легковесна, по умолчанию красивее XFCE, корни растут из LXDE)
uk: LXQt (ще легша, за замовчуванням красивіша за XFCE, коріння росте з LXDE)

source: LXDE (пожалуй самая легковесная оболочка из популярных. Не красиво)
uk: LXDE (мабуть, найлегша оболонка з популярних. Не гарненька)

source: Unity (когда-то крутая оболочка, но скажем спасибо Canonical, что прекратили ее развитие)
uk: Unity (раніше це була крута оболонка, але давайте подякуємо Canonical за зупинку її розвитку)

source: Вывод
uk: Висновок

source: Для новичков, или вы хотите поставить, настроить и забыть, лишь обновляя пакеты, ставим только Ubuntu или что-либо на ее основе (напр. Linux Mint). Если же вы уже прошаренный, то советую попробовать Arch-like. Установку и настройку рассмотрим в следующем параграфе.
uk: Для новачків, якщо ви хочете поставити, налаштувати і забути, лише оновлюючи пакети, ставимо лише Ubuntu або що-небудь на її основі (напр. Linux Mint). Якщо ж ви вже досвідчений користувач, то раджу спробувати Arch-like. Встановлення та налаштування розглянемо в наступному параграфі.

source: Параграф 2: Установка и настройка системы
uk: Параграф 2: Встановлення та налаштування системи

source: И так, вы выбрали дистрибутив. Приступим к установке!
uk: Отже, ви вибрали дистрибутив. Приступимо до встановлення!

source: Для установки нам потребуется:
uk: Для установки нам знадобляться:

source: Рабочий компьютер
uk: Робочий комп'ютер

source: USB флэшка
uk: USB флешка

source: Интернет соединение
uk: Підключення до Інтернету

source: Скачиваем дистрибутив
uk: Завантажуємо дистрибутив

source: Тут все просто, думаю не стоит объяснять. Просто заходите на сайт выбранного дистрибутива, и скачиваете последнюю версию. Обычно скачивание прямое, но иногда можно скачать через торрент, от себя советую этот способ, т. к. таким способом скачается быстрее.
uk: Тут все просто, думаю, не варто пояснювати. Просто заходите на сайт обраного дистрибутива і завантажуєте останню версію. Зазвичай скачування пряме, але іноді можна скачати через торрент, від себе раджу цей спосіб, тому що в такий спосіб завантажиться швидше.

source: Ссылки на сайты основных дистрибутивов находятся в предыдущем параграфе
uk: Посилання на сайти основних дистрибутивів знаходяться в попередньому параграфі

source: Скачали? Тогда переходим к следующему шагу!
uk: Скачали? Тоді переходимо до наступного кроку!

source: Записываем установщик на флэшку
uk: Записуємо інсталятор на флешку

source: Рассматривать метод с CD/DVD-ROM не буду, так как кто этой древностью сейчас пользуется?
uk: Розглядати метод із CD/DVD-ROM не розглядатиму, бо хто цією древністю зараз користується?

source: Уточню, что рассматриваться будут способы записи на Windows, так как предполагается, что вы собираетесь поставить Linux второй системой/перейти на него для сборки прошивок и других полезных дел.
uk: Уточню, що розглядатися будуть способи запису на Windows, оскільки передбачається, що ви збираєтеся поставити Linux другою системою/перейти на нього для збірки прошивок та інших корисних справ.

source: Так, нам нужна утилита для записи. Подойдет Etcher или тот же Rufus, без разницы. Рассмотрим подробнее…
uk: Так, нам потрібна утиліта для запису. Підійде Etcher або той же Rufus, без різниці. Розглянемо докладніше…

source: [Etcher](#вариант-с-etcher)
uk: [Etcher] (#вариант-з-etcher)

source: [Rufus](#вариант-с-rufus)
uk: [Rufus](#вариант-з-rufus)

source: [Ventoy](#вариант-с-ventoy)
uk: [Ventoy](#вариант-з-ventoy)

source: Вариант с Etcher
uk: Варіант з Etcher

source: Скачиваем утилиту с сайта https://www.balena.io/etcher/. Вставляем ненужную флэшку в компьютер. Ну или нужную, просто предварительно скопируйте все нужные вам данные с нее. Запускаем Etcher
uk: Завантажуємо утиліту із сайту https://www.balena.io/etcher/. Вставляємо непотрібну флешку в комп'ютер. Ну або потрібну, просто попередньо скопіюйте всі потрібні вам дані з неї. Запускаємо Etcher

source: Откроется данное окно. Как видно, тут все предельно просто:
uk: Відкриється це вікно. Як видно, тут усе максимально просто:

source: Все, загрузочная флэшка записана
uk: Усе, завантажувальну флешку записано

source: Вариант с Rufus
uk: Варіант з Rufus

source: Тут все немного по-сложнее чем с Etcher, но тоже просто.
uk: Тут усе трохи складніше, ніж з Etcher, але теж просто.

source: Скачиваем утилиту с сайта https://rufus.ie/. Запускаем…
uk: Завантажуємо утиліту з сайту https://rufus.ie/. Запускаємо…

source: Откроется данное окно.
uk: Відкриється це вікно.

source: Выбираем устройство
uk: Вибираємо пристрій

source: Выбираем образ дистрибутива
uk: Вибираємо образ дистрибутива

source: В случае с Linux образами без разницы какой тип разделов на флешке выбирать, это имеет вес для Windows образов. Так же не имеет веса настройки файловой системы. Вот как примерно выглядит окно после настройки
uk: Що стосується образів Linux, не має значення, який тип розділів на флешці вибрати, це має вагу для образів Windows. Налаштування файлової системи також не мають ваги. Приблизно так виглядає вікно після налаштування

source: Нажимаем Старт
uk: Натискаємо Старт

source: **Важно!** Вас спросят о способе записи образа, так как почти все образы с Linux являются ISO-Hybrid образами. Не буду вдаваться в подробности, скажу только что нужно **обязательно выбрать “Запись в режиме DD-образ”**
uk: **Важливо!** Вас запитають про спосіб запису образу, оскільки майже всі образи з Linux є ISO-Hybrid образами. Не буду вдаватися в подробиці, скажу тільки що потрібно **обов'язково вибрати "Запис у режимі DD-образ "**

source: Соглашаемся с этим
uk: Ми з цим згодні

source: Остается только ждать…
uk: Все, що ми можемо зробити, це почекати…

source: Вариант с Ventoy
uk: Варіант з Вентой

source: Ventoy - это инструмент с открытым исходным кодом для создания загрузочного USB-накопителя для файлов ISO/WIM/IMG/VHD(x)/EFI. С Ventoy не нужно форматировать диск снова и снова, достаточно скопировать файлы образов на USB-накопитель и загрузить его. Можно скопировать много файлов образов одновременно, и ventoy предложит меню загрузки для их выбора.
uk: Ventoy - інструмент з відкритим вихідним кодом для створення завантажувального USB-накопичувача для файлів ISO/WIM/IMG/VHD(x)/EFI. З Ventoy вам не потрібно форматувати диск знову і знову, просто скопіюйте файли образів на USB-накопичувач і завантажте його. Є можливість скопіювати відразу багато файлів образів, і Ventoy запропонує меню, щоб вибрати їх.

source: Именно эта утилита является самой продвинутой среди двух ранее рассмотренных вариантов. Как было понятно с описания - вам следует всего лишь перекинуть .iso образ диска на флешку и все. Никакого форматирования вашего 1ТБ диска, чтобы записать жалкие ~5гб образа, не прекрасно ли? Прекрасно.
uk: Ця утиліта є найбільш просунутою серед двох раніше розглянутих варіантів. Як було зрозуміло з опису - потрібно просто перенести .iso образ диска на флешку і все. Ніякого більше форматування диска на 1 ТБ, щоб записати скромний образ ~ 5 Гб, чи не чудово? Це здорово.

source: **Приступаем к установке!**
uk: ** Почнемо встановлювати! **

source: Заходим на GitHub проекта, в
uk: Перейдемо до GitHub проекту, в

source: качаем последнюю сборку
uk: качаємо останню збірку

source: Распаковываем, запускаем
uk: Розпаковуємо, запускаємо

source: Получаем на выходе простой интерфейс, где мы выбираем диск, на который будет установлен Ventoy
uk: Отримуємо на виході простий інтерфейс, де ми вибираємо диск, на який буде встановлено Ventoy

source: **ВАЖНО!** Все данные с диска будут удалены/отформатированы. Не забудьте забэкапить влажные файлы
uk: **ВАЖЛИВО! ** Всі дані з диска будуть видалени/відформатовані. Не забудьте створити резервну копію вологих файлів

source: Жмем кнопку Install… Profit
uk: Тиснемо кнопку Install... Profit

source: В результате у нас появится раздел с названием Ventoy, на который можно простым движением переместить образ системы.
uk: В результаті у нас вийде розділ під назвою Ventoy, в який можна просто перемістити образ системи.

source: Грузимся с этой флешки.
uk: Завантажуємося з цієї флешки.

source: После того, как мы записали флэшку, самое время установить систему!
uk: Після того, як ми записали флешку, настав час встановити систему!

source: Установка системы
uk: Встановлення системи

source: К сожалению, раскрыть данный этап подробно я не могу ввиду технических возможностей. Но в интернете очень много гайдов, и ставить ту же Ubuntu не сложнее чем Windows. Установка
uk: На жаль, я не можу детально розкрити цей етап через технічні можливості. Але керівництв в інтернеті дуже багато, і встановити той же Ubuntu не складніше Windows. Установка

source: Я буду очень надеяться, что мои “коллеги” дополнят этот раздел подробной инструкцией
uk: Я буду дуже сподіватися, що мої "колеги" доповнять цей розділ детальною інструкцією

source: Настройка среды
uk: Налаштування середовища

source: Установка необходимых пакетов
uk: Установка необхідних пакетів

source: Настройка git
uk: Налаштування Git

source: Вписываем свой никнейм и почту на GitHub:
uk: Вписуємо свій нікнейм і пошту на GitHub:

source: Включаем поддержку lfs:
uk: Вмикаємо підтримку LFS:

source: Параграф 3: Скачиваем исходники прошивки
uk: Параграф 3: Скачуємо вихідні коди прошивки

source: Работать будем целиком в терминале, чтобы не бегать из терминала в UI и обратно.
uk: Працювати будемо цілком у терміналі, щоб не бігати з терміналу в UI і назад.

source: Создаем папку, где будет хранится наша прошивка и заходим в неё. Пусть она условно будет называться LOS (сокращенное название Lineage OS), но можно назвать как угодно и еще даже циферки написать :)
uk: Створюємо папку, де зберігатиметься наша прошивка і заходимо в неї. Нехай вона умовно називатиметься LOS (скорочена назва Lineage OS), але можна назвати як завгодно і ще навіть циферки написати :)

source: Отлично, теперь требуется скачать исходники прошивки. Открываем
uk: Чудово, тепер потрібно завантажити вихідні коди прошивки. Відкриваємо

source: и офигеваем, какое большое там количество всего. И все это качать? Да, но не вручную, а с помощью утилиты repo. Открываем репозиторий
uk: і ми офігіваємо, скільки їх є. І завантажити все це? Так, але не від руки, а за допомогою утиліти repo. Відкрийте репозиторій

source: либо manifest (зависит от прошивки), обычно он закреплен.
uk: або manifest (в залежності від прошивки), зазвичай він закріплений.

source: Ага! Первым делом в Readme видим как скачать. Замечательно :) Вводим
uk: Ага! Насамперед у Readme бачимо як завантажити. Чудово :) Вводимо

source: **Примечание.** Для экономии места на диске, можно использовать параметр –depth=1, который говорит не скачивать всю историю измнений.
uk: **Примітка** Щоб заощадити місце на диску, ви можете використовувати параметр --depth=1, який повідомляє вам не завантажувати всю історію змін.

source: Скачивание началось и ждем.
uk: Завантаження почалося, тому чекаємо.

source: **Примечание.** Чтобы обновить исходники, введите просто в папке с исходниками
uk: **Примечание.** Щоб оновити вихідні коди, введіть просто в директорії з вихідними кодами

source: Если Вы хотите ограничить скорость закачивания, требуется ввести количество потоков.
uk: Якщо Ви хочете обмежити швидкість закачування, потрібно ввести кількість потоків.
