Repository: CakesTwix/translating-BookAboutBuilding
Catalog: po/*.po
Languages: uk

source: И так, для базы своего дерева я рекомендую взять дерево для Lineage OS. И так, почему? Потому что Lineage OS реализовала некоторые фичи, которые также используются в Lineage-based прошивках (логично), либо были портированы на AOSP-based прошивки. К примеру:
uk: Отже, для бази свого дерева я рекомендую взяти дерево для Lineage OS. І так, чому? Тому що Lineage OS реалізувала деякі фічі, які також використовуються в Lineage-based прошивках (логічно), або були портовані на AOSP-based прошивки. Наприклад:

source: `FlipFlap` (поддержка магнитных чехлов)
uk: `FlipFlap` (підтримка магнітних чохлів)

source: `Touch HAL` (поддержка кастомных фич тачскрина)
uk: `Touch HAL` (підтримка кастомних фіч тачскріна)

source: `LiveDisplay HAL` (поддержка кастомной настройки дисплея)
uk: `LiveDisplay HAL` (підтримка кастомного налаштування дисплея)

source: В пример возьмем дерево для mido.
uk: За приклад візьмемо дерево для mido.

source: Общие моменты
uk: Загальні моменти

source: Как мы уже выяснили, есть конфиг lineage_mido.mk. Его надо переименовать в соответствии с прошивкой (см. другие деревья для этой прошивки). К примеру, в carbon_mido.mk. Далее открываем этот файл. Находим переменную PRODUCT_NAME, там будет следующий текст
uk: Як ми вже з'ясували, є конфіг lineage_mido.mk. Його треба перейменувати відповідно до прошивки (див. інші дерева для цієї прошивки). Наприклад, у carbon_mido.mk. Далі відкриваємо цей файл. Знаходимо змінну PRODUCT_NAME, там буде такий текст

source: Логично предположить, что lineage надо менять на carbon
uk: Логічно припустити, що lineage треба міняти на carbon

source: Чуть выше мы увидим данный код
uk: Трішки вище ми побачимо цей код

source: Так-с, здесь надо смотреть на что менять. К примеру в CarbonROM надо вписать следующий код (это для смартфонов, так как mido это смартфон, а не планшет или что-то еще)
uk: Так-с, тут треба дивитися на що змінювати. Наприклад, у CarbonROM треба вписати наступний код (це для смартфонів, оскільки mido це смартфон, а не планшет або щось ще)

source: Так, сохраняем, открываем AndroidProducts.mk. Сразу видим, что у нас есть следующий код
uk: Так, зберігаємо, відкриваємо AndroidProducts.mk. Одразу бачимо, що в нас є такий код

source: Опять-таки логично подумать, что надо lineage поменять на carbon (как минимум мы же переименовали lineage_mido.mk в carbon_mido.mk), это верно. lineage_mido.mk меняем на carbon_mido.mk, а lineage_mido-user и т. д. меняем на carbon_mido-user и т. д. (это вариации какой билд можно собрать). И должно получиться нечто такое
uk: Знову ж таки логічно подумати, що lineage треба поміняти на carbon ( як мінімум ми ж перейменували lineage_mido.mk на carbon_mido.mk), це правильно. lineage_mido.mk міняємо на carbon_mido.mk, а lineage_mido-user і т. д. міняємо на carbon_mido-user і т. д. (це варіації який білд можливо зібрати). І має вийти щось таке

source: По факту хватит всего того, что описано выше.
uk: За фактом вистачить усього того, що описано вище.

source: Выясняем, чего нету в прошивке. В CarbonROM к примеру нету каких либо из фич, которые я перечислял в самом начале параграфа. Требуется вырезать Touch HAL, LiveDisplay и FlipFlap overlay, если все это есть и этого в прошивке нет. Touch HAL лежит в папке touch, LiveDisplay HAL - в папке livedisplay, FlipFlap overlay - в lineage-overlay/packages/apps/FlipFlap. Все эти папки вырезаем. Далее открываем файл device.mk и убираем следующий код
uk: З'ясовуємо, чого немає в прошивці. У CarbonROM, наприклад, немає якихось фіч, які я перераховував на самому початку параграфа. Потрібно вирізати Touch HAL, LiveDisplay і FlipFlap overlay, якщо все це є і цього в прошивці немає. Touch HAL лежить у папці touch, LiveDisplay HAL - у папці livedisplay, FlipFlap overlay - у lineage-overlay/packages/apps/FlipFlap. Усі ці папки вирізаємо. Далі відкриваємо файл device.mk і видаляємо такий код

source: Также вырезаем сборку Trust HAL (если его в прошивке нет)
uk: Також вирізаємо збірку Trust HAL (якщо в прошивці його немає)

source: Сохраняем и закрываем файл.
uk: Зберігаємо і закриваємо файл.

source: Теперь требуется отредактировать SEPolicy! Открываем sepolicy/vendor/file_contexts и находим следующее:
uk: Тепер потрібно відредагувати SEPolicy! Відкриваємо sepolicy/vendor/file_contexts і знаходимо таке:

source: Вспоминаем, что LideDisplay HAL и Touch HAL были благополучно удалены, поэтому удаляем эти две строчки, но надо убрать в SEPolicy еще и правила для hal_lineage_livedisplay_qti_exec и hal_lineage_touch_default_exec. Самое простое - grep’нуть все правила SEPolicy нашего дерева. Делается так:
uk: Згадуємо, що LiveDisplay HAL і Touch HAL були успішно видалені, тому видаляємо ці два рядки, але треба прибрати в SEPolicy ще й правила для hal_lineage_livedisplay_qti_exec і hal_lineage_touch_default_exec. Найпростіше - grep'нути всі правила SEPolicy нашого дерева. Робиться так:

source: Таким образом мы увидим все файлы, которые имеют включение текста “place_here\*\_\*searched_text”, надеюсь логика понятна. И так, ищем и удаляем эти правила. Если файл состоит целиком из того, что относится к искомым типам, то попросту удаляем (скорее всего так и будет). Уря! Готово!
uk: Таким чином ми побачимо всі файли, які мають включення тексту "place_here*_*searched_text", сподіваюся, логіка зрозуміла. Отже, шукаємо і видаляємо ці правила. Якщо файл складається повністю з того, що належить до типів, які ми шукаємо, то просто видаляємо його (найімовірніше, так і буде). Уря! Готово!

source: Тут по факту хватило бы общих моментов для данного дела, однако мы помним, что есть такие фичи как Touch HAL и LiveDisplay HAL! Их можно написать и добавить правила SEPolicy для них. Если Вы написали/портировали/перенесли HAL и он работает в Permissive, то я поздравляю. Следующий шаг это добавить новый HAL в file_contexts, собрать прошивку и установить ее. Далее вертим HAL как можем, чтобы набрались отказы SEPolicy. Как только мы собрали все отказы, сохраняем logcat и добавляем эти правила на базе собранных отказов. Переводим SELinux в Enforcing, собираем, ставим и проверяем. Если все работает, то я поздравляю, Вы сделали это!
uk: Тут фактично вистачило б загальних моментів для цієї справи, однак ми пам'ятаємо, що є такі фічі, як Touch HAL і LiveDisplay HAL! Їх можна написати і додати правила SEPolicy для них. Якщо Ви написали/портували/перенесли HAL і він працює в Permissive, то я вітаю. Наступний крок - це додати новий HAL у file_contexts, зібрати прошивку і встановити її. Далі крутимо HAL як можемо, щоб набралися відмови SEPolicy. Щойно ми зібрали всі відмови, зберігаємо logcat і додаємо ці правила на базі зібраних відмов. Переводимо SELinux в Enforcing, збираємо, ставимо і перевіряємо. Якщо все працює, то я вітаю, Ви зробили це!

source: Напоследок
uk: Наостанок

source: Не гнушайтесь смотреть чужие деревья. Вы не можете сходу все знать. Делайте по примеру других и чуть-чуть вносите свою лепту, если это требуется. И сохраняйте авторство! :)
uk: Не соромтеся дивитися чужі дерева. Ви не можете відразу все знати. Робіть за прикладом інших і трохи вносіть свою частку, якщо це потрібно. І зберігайте авторство! :)

source: В этой главе мы расскажем о:
uk: У цьому розділі ми розповімо про:

source: обновлении проприетарных библиотек устройства;
uk: оновлення пропрієтарних бібліотек пристрою;

source: патчинге проприетарных библиотек;
uk: патчингу пропрієтарних бібліотек;

source: обновлении компонентов дерева;
uk: оновлення компонентів дерева;

source: работе с sepolicy;
uk: роботі з sepolicy;

source: обновлении и сборке ядра.
uk: оновленні та збірці ядра.

source: Со всем этим Вы столкнетесь в своей “карьере” сопровождающего Android-устройства. Можно задать резонный вопрос: “Зачем обновлять что-либо, если оно и так работает?” Android не стоит на месте, как и кастомные прошивки, требуется следить за новшествами и за обновлением различных специфичных компонентов вашего устройства, как ядро, дерево и библиотеки - все это постоянно или с переменным успехом обновляется. К примеру, в плане ядра Linux выходят новые версии ядер с исправлениями и улучшениями, а также CAF постоянно полирует код для своих процессоров. Если мы говорим про патчинг, то есть такая проблема, что некоторые проприетарные библиотеки крайне специфичны и их ничем подменить нельзя. Приходится их патчить, чтобы они работали с более новой версией Android.
uk: З усім цим Ви зіткнетеся у своїй "кар'єрі" супроводжуючого Android-пристроя. Можна поставити обґрунтоване запитання: "Навіщо оновлювати що-небудь, якщо воно і так працює?" Android не стоїть на місці, як і кастомні прошивки, потрібно стежити за нововведеннями і за оновленням різних специфічних компонентів вашого пристрою, як-от ядро, дерево і бібліотеки - все це постійно або зі змінним успіхом оновлюється. Наприклад, у плані ядра Linux виходять нові версії ядер з виправленнями і поліпшеннями, а також CAF постійно шліфує код для своїх процесорів. Якщо ми говоримо про патчінг, то є така проблема, що деякі пропрієтарні бібліотеки вкрай специфічні і їх нічим підмінити не можна. Доводиться їх патчити, щоб вони працювали з більш новою версією Android.

source: Параграф 1: Дампы, vendor, proprietary-files.txt и обновление библиотек
uk: Параграф 1: Дампи, vendor, proprietary-files.txt і оновлення бібліотек

source: Здесь мы начнем говорить о том, что такое дампы, где их взять и как взаимосвязаны vendor и proprietary-files.txt. Уточню, что здесь будет речь не о разделе vendor, а о vendor tree, для краткости я буду писать просто vendor.
uk: Тут ми почнемо говорити про те, що таке дампи, де їх взяти і як взаємопов'язані vendor і proprietary-files.txt. Уточню, що тут йтиметься не про розділ vendor, а про vendor tree, для стислості я писатиму просто vendor.

source: Начнем с конца.
uk: Почнемо з кінця.

source: Vendor и proprietary-files.txt
uk: Vendor та proprietary-files.txt

source: В деревьях вы могли видеть файлик **proprietary-files.txt**. Если вы его открывали, то видели, что это по факту список того, что лежит в vendor’е. Также подобных файлов может быть несколько. В деревьях устройств на базе процессоров Qualcomm Snapdragon часто можно было встретить **proprietary-files-qc.txt** - это список файлов для common vendor. К примеру, у mido и tissot был common vendor и в их деревьях можно было встретить proprietary-files-qc.txt.
uk: У деревах ви могли бачити файлик **proprietary-files.txt**. Якщо ви його відкривали, то бачили, що це фактично список того, що лежить у vendor'і. Таких файлів може бути кілька. У деревах пристроїв на базі процесорів Qualcomm Snapdragon часто можна було зустріти **proprietary-files-qc.txt** - це список файлів для common vendor. Наприклад, у mido і tissot був common vendor і в їхніх деревах можна було зустріти proprietary-files-qc.txt.

source: Здесь я приведу синтаксис данных списков. Позже вы поймете зачем и почему.
uk: Тут я наведу синтаксис даних списків. Пізніше ви зрозумієте навіщо і чому.

source: **Синтаксис строки выглядит так:**
uk: **Синтаксис рядка має такий вигляд:**

source: `-` - если блоб является модулем, и требуется что-то собрать с использованием этого блоба,
uk: `-` - якщо блок є модулем, і потрібно щось зібрати з використанням цього блобу,

source: пример
uk: наприклад

source: `source` - из какого места был взят блоб и, если `:destination` нет, то где будет лежать в готовом вендоре
uk: `source` - з якого місця був взятий блоб і, якщо `:destination` немає, то де буде лежати в готовому вендорі

source: `destination` - где будет лежать блоб в готовом vendor’е
uk: `destination` - де лежатиме блоб у готовому vendor'і

source: `sha1sum` - sha1 хеш-сумма
uk: `sha1sum` - sha1 хеш-сума

source: Таким образом, файл **proprietary-files.txt** является списком файлов и библиотек, которые нужно скопировать в директорию vendor при сборке системы. Эти файлы обычно являются частью проприетарного кода или библиотек, которые не могут быть распространены свободно. Они нужны для того, чтобы устройство работало корректно и могло использовать все свои функции.
uk: Тож файл **proprietary-files.txt** є списком файлів і бібліотек, які потрібно скопіювати в директорію vendor під час збірки системи. Ці файли зазвичай є частиною пропрієтарного коду або бібліотек, які не можуть бути поширені вільно. Вони потрібні для того, щоб пристрій працював коректно і міг використовувати всі свої функції.

source: Дампы
uk: Дампи

source: Дамп - (dump) - разобранная прошивка на файлы, благодаря чему есть возможность достать любой файл и что-либо с ним сделать. Дампы можно сделать с помощью различных дамперов:
uk: Дамп - (dump) - розібрана прошивка на файли, завдяки чому є можливість дістати будь-який файл і що-небудь зробити із ним. Дампи можна зробити за допомогою різних дамперів:

source: Так же Вы можете найти готовые дампы на просторах интернета. К сожалению, мы не можем предоставить ссылки на репозитории с дампами. Но если поспрашивать сообщество, Вы найдете все необходимое :)
uk: Так само Ви можете знайти готові дампи на просторах інтернету. На жаль, ми не можемо надати посилання на репозиторії з дампами. Але якщо розпитати спільноту, Ви знайдете все необхідне :)

source: Параграф 5: Обновление и сборка ядра
uk: Параграф 5: Оновлення та збірка ядра

source: Для обновления ядра, вам нужен хотя бы средний уровень знаний того, как же работает ядро (см.
uk: Щоб оновити ядро, потрібен хоча б середній рівень знань про те, як працює ядро (див.

source: что такое ядро
uk: що таке ядро

source: ) и в целом Android, а так же умение пользоваться git (см.
uk: ) і Андроїд в цілому, а також можливість використовувати git (див.

source: ходовые команды git
uk: ходові команди git

source: Обновление
uk: Оновлення

source: Подготовка
uk: Підготовка

source: Давайте, для начала узнаем какие стабильные версии ядра Android на данный момент (2022 г.) активно обновляются. Вот список для наглядности: _4.9, 4.14, 4.19, 5.4, 5.10, 5.15_. Должен сразу предупредить, что обновить ядро, предположим, с 4.9 до 4.19 без перебазирования невозможно, более того, обычно производитель делает специфические драйвера устройства только для одной версии и не обновляет дальше, а так же само ядро может не поддерживать ваш чипсет и без углублённых знаний в ядре обновить драйвера у вас не получится. Поэтому, зачастую, маинтейнеры обновляют **sublevel** ядра, это мы и будем делать ниже. Чтобы узнать его, заходим в исходник ядра, которое хотим обновить, в корне находим и открываем файлик **Makefile**, в самом верху (обычно) видим такую картину:
uk: Давайте, для початку дізнаємося, які стабільні версії ядра Android на даний момент (2022 р.) активно оновлюються. Ось список для наочності: *4.9, 4.14, 4.19, 5.4, 5.10, 5.15*. Повинен одразу попередити, що оновити ядро, припустимо, з 4.9 до 4.19 без перебазування неможливо, більше того, зазвичай виробник робить специфічні драйвера пристрою тільки для однієї версії і не оновлює далі, також саме ядро може не підтримувати ваш чіпсет, і без поглиблених знань у ядрі оновити драйвера у вас не вийде. Тому, найчастіше, маінтейнери оновлюють **sublevel** ядра, це ми і будемо робити нижче. Щоб дізнатися його, заходимо у вихідник ядра, яке хочемо оновити, у корені знаходимо і відкриваємо файлик **Makefile**, у самому верху (зазвичай) бачимо таку картину:

source: _Либо просто заходим на своём смартфоне в Настройки > О Телефоне (только если на смартфоне установлено то же ядро, исходники которого вы собираететсь обновить_)
uk: _Або просто заходимо на своєму смартфоні в Налаштування > Про Телефон (тільки якщо на смартфоні встановлено те саме ядро, вихідні коди якого ви збираєтеся оновити_)

source: Узнали. После этого нужно найти репозиторий общего (common) ядра, с которого и будем обновлять, обычно используют https://android.googlesource.com/kernel/common/, но можно и другие зеркала. Например https://git.codelinaro.org/clo/la/kernel/msm (только для Qualcomm).
uk: Дізналися. Після цього потрібно знайти репозиторій загального (common) ядра, з якого і будемо оновлювати, зазвичай використовують https://android.googlesource.com/kernel/common/, але можна й інші дзеркала. Наприклад https://git.codelinaro.org/clo/la/kernel/msm (тільки для Qualcomm).

source: Смотрим в список бранчей и выбираем со своей версией ядра:
uk: Дивимося в список гілок і вибираємо зі своєю версією ядра:

source: После чего смотрим на название последнего коммита, должно быть что-то по типу `Merge <версия ядра>`, если sublevel выше, чем в ваших в исходниках, тогда можно продолжать. Если же нет, то поздравляю, у вас последняя версия
uk: Після чого дивимося на назву останнього комміту, має бути щось на кшталт `Merge <версія ядра>`, якщо sublevel вищий, ніж у ваших у вихідних кодах, тоді можна продовжувати. Якщо ж ні, то вітаю, у вас найновіша версія

source: Скачиваем репозитории
uk: Завантажуємо репозиторії

source: Для примера, я буду использовать
uk: Наприклад, я буду використовувати

source: ядро от Lenovo Z5s (jd2019) и обновлю его до
uk: ядро від Lenovo Z5s (jd2019) і оновлю його до

source: . Также, для удобства, рекомендую использовать
uk: . Також для зручності рекомендую використовувати

source: , хоть в нём и не присутствует весь функционал.
uk: , навіть незважаючи на те, що він володіє не всіма функціональними можливостями.

source: Для начала нам нужно склонировать исходники своего ядра (описывать как это делать я думаю не нужно), после добавляем репозиторий в GitHub Desktop (опять же, это не обязательно, все действия можно выполнить только через git).
uk: Для початку нам потрібно склонувати вихідні коди свого ядра (описувати, як це робити, я думаю, не потрібно), після цього додаємо репозиторій до GitHub Desktop (знову ж таки, це не обов'язково, всі дії можна виконати тільки через git).

source: Затем, открываем терминал в папке с исходниками вашего ядра и добавляем наш удаленный репозиторий общего ядра командой:
uk: Потім, відкриваємо термінал у директорії з вихідними кодами вашого ядра і додаємо наш віддалений репозиторій загального ядра командою:

source: `common` - название, можете использовать любое другое `url` - ссылка на репозиторий
uk: `common` - назва, можете використовувати будь-яку іншу `url` - посилання на репозиторій

source: Теперь фетчим добавленный репозиторий:
uk: Тепер фетчимо доданий репозиторій:

source: _Если вам лень или не позволяет интернет скачать весь репозиторий, можете в конце команды добавить название бранча, тогда скачивать будет только его._
uk: _Якщо вам ліньки або не дозволяє інтернет завантажити весь репозиторій, можете наприкінці команди додати назву бранча, тоді завантажувати буде тільки його._

source: Мержим изменения
uk: Мержим зміни

source: Обновлять ядро лучше всего по одному саблевелу - так больший шанс понять в какой версии и коммите проблема, если у вас будут ошибки при сборке, либо в самой системе, я же рисковый и делал сразу по пять (о чём потом пожалел).
uk: Оновлювати ядро найкраще за все по одному саблевелу - так більший шанс зрозуміти, у якій версії та комітеті проблема, якщо у вас будуть помилки під час збирання, або в самій системі, я ж ризиковий і робив одразу по п'ять (про що потім пошкодував).

source: Находим нужную нам версию с помощью поиска в разделе тэгов:
uk: Знайдіть потрібну нам версію, пошукавши в розділі тегів:

source: Копируем SHA и мержим этот коммит в нашем бранче:
uk: Копіюємо SHA і мержимо цей коміт у нашому бранчі:

source: Если никаких конфликтов нет, то можете замержить ещё пару. Но опять же, вы не будете знать на какой версии у вас всё поломалось, так что лучше мержить по одному-два и собирать, если ядро собралось и система запустилась, то переходим к следующим саблевелам.
uk: Якщо жодних конфліктів немає, то можете заміржити ще кілька. Але знову ж таки, ви не знатимете, на якій версії у вас все поламалося, тож краще помержити по одному-два і збирати, якщо ядро зібралося і система запустилася, то переходимо до наступних саблевелів.

source: Фиксим конфликты
uk: Фіксимо конфлікти

source: Здесь всё довольно муторно. Лично я делаю по такой схеме: если появляются конфликты, то открываю GitHub Desktop, с помощью него намного легче найти их, т.к. они все сразу отображаются вместе с поломанными строками. Если конфликт простой, то фикшу вручную, если же ничего не понятно, то захожу в common репо, открываю просмотр файлов во временной точке нужного тэга и ищу этот конфликтный файл там, открываю историю коммитов для него и смотрю как делали там и просто повторяю все изменения в свой файл. Конфликтных файлов может быть очень много, так что наберитесь терпения и не спешите, т.к. одна лишняя строчка или ошибка в тексте и ядро у вас не соберётся, либо не запустится.
uk: Тут усе досить складно. Особисто я роблю за такою схемою: якщо з'являються конфлікти, то відкриваю GitHub Desktop, за допомогою нього набагато легше знайти їх, тому що вони всі одразу відображаються разом із поламаними рядками. Якщо конфлікт простий, то фікшу вручну, якщо ж нічого не зрозуміло, то заходжу в common репо, відкриваю перегляд файлів у тимчасовій точці потрібного тега і шукаю цей конфліктний файл там, відкриваю історію комітів для нього і дивлюся, як робили там, і просто повторюю всі зміни у свій файл. Конфліктних файлів може бути дуже багато, тож наберіться терпіння і не поспішайте, тому що один зайвий рядок або помилка в тексті, і ядро у вас не збереться або не запуститься.

source: Сборка ядра
uk: Збірка ядра

source: Из исходников прошивки
uk: З вихідних кодів прошивки

source: Этот способ для тех, кто уже знает как собирать прошивки и т.п. Проходим по обычному сценарию подготовки к сборке прошивки, только вместо команды запуска сборки прошивки (`mka bacon`, `make bacon` и др.), пишем `mka bootimage`.
uk: Цей спосіб для тих, хто вже знає як збирати прошивки тощо. Проходимо за звичайним сценарієм підготовки до збірки прошивки, тільки замість команди запуску збірки прошивки (`mka bacon`, `make bacon` та ін.), пишемо `mka bootimage`.

source: Из папки ядра
uk: З папки ядра

source: Скачайте исходный код ядра Android и перейдите в папку с ним с помощью команды:
uk: Скачайте вихідний код ядра Android і перейдіть в папку з ним за допомогою команди:

source: Убедитесь, что у вас установлены необходимые инструменты для сборки ядра, такие как компилятор GCC/Clang, библиотека make, инструменты для работы с архивами (tar, gzip и т.д.) и другие.
uk: Переконайтеся, що у вас встановлені необхідні інструменти для збірки ядра, як-от компілятор GCC/Clang, бібліотека make, інструменти для роботи з архівами (tar, gzip тощо) та інші.

source: Выберите конфигурацию ядра, которую хотите собрать:
uk: Виберіть конфігурацію ядра, яку ви хочете створити:

source: Эта команда создаст файл конфигурации ядра с набором опций по умолчанию. Конечно же, выбираете свой defconfig
uk: Ця команда створить файл конфігурації ядра з набором опцій за замовчуванням. Звичайно ж, вибираєте свій defconfig

source: Эта команда откроет интерактивное меню, где вы сможете выбрать нужные опции ядра с помощью стрелочек.
uk: Ця команда відкриє інтерактивне меню, де за допомогою стрілок ви зможете вибрати потрібні параметри ядра.

source: Запустите сборку ядра с помощью команды:
uk: Запустіть збірку ядра за допомогою команди:

source: Где N - это количество ядер вашего процессора. Это позволит ускорить сборку, так как она будет выполняться параллельно на разных ядрах.
uk: Де N - кількість ядер вашого процесора. Це прискорить збірку, так як вона буде працювати паралельно на різних ядрах.

source: После успешной сборки ядро будет доступно в каталоге `arch/architecture/boot/` (где architecture - это архитектура вашего устройства, например, x86 или arm).
uk: Після успішної збірки ядро буде доступно в каталозі `arch/architecture/boot/` (де architecture є архітектурою вашого пристрою, наприклад x86 або arm).

source: Параграф 1: ошибки сборки (SELinux, нехватка пакетов, ресурсов и тд)
uk: Параграф 1: Помилки збірки (SELinux, нестача пакетів, ресурсів і тд)
