Repository: CakesTwix/translating-BookAboutBuilding
Catalog: po/*.po
Languages: uk

source: Где # - количество потоков. Автор обычно вручную ставит 16 потоков для быстрого скачивания. Так же существуют самые разные агрументы для этих команд, подробнее:
uk: Де # - кількість потоків. Автор зазвичай вручну встановлює 16 потоків для швидкого скачування. Існують також різноманітні аргументи для цих команд, докладніше:

source: Такой репозиторий, который мы открыли, обычно состоит из манифестов, которые представляют из себя xml файлы. Один файл может подключать другие файлы, тем самым не надо все хранить в одном файле, удобно. default.xml это манифест, в котором хранятся все исходники AOSP и исходники AOSP, которые были модифицированы командой Linege OS. В snippets/lineage.xml лежат уже исходники Lineage OS за их авторством, к примеру всеми известный плеер Eleven.
uk: Такий репозиторій, який ми відкрили, зазвичай складається з маніфестів, які являють собою xml файли. Один файл може підключати інші файли, тим самим не треба все зберігати в одному файлі, зручно. default.xml - це маніфест, у якому зберігаються всі вихідні коди AOSP і вихідні коди AOSP, які були модифіковані командою Linege OS. У snippets/lineage.xml лежать вже вихідні коди Lineage OS за їхнім авторством, наприклад, усіма відомий програвач Eleven.

source: И в принципе на этом параграф заканчивается, единственное, что хотелось бы немного рассказать про локальные манифесты.
uk: І в принципі на цьому параграф закінчується, єдине, що хотілося б трішки розповісти про локальні маніфести.

source: Локальные манифесты это манифесты, которые были написаны вручную или сгенерированы автоматически системой сборки для скачивания некоторых специфичных исходников, таких как ядра, common деревья и других репозиториев.
uk: Локальні маніфести - це маніфести, які були написані вручну або згенеровані автоматично системою збірки для скачування деяких специфічних вихідних кодів, таких як ядра, common дерева та інших репозиторіїв.

source: Они находятся в `.repo/local_manifests/`. Может будет вопрос “а зачем он нам?”. Все просто, не нужно вводить кучу команд для скачивания нескольких репозиториев себе, а просто положить .xml файл, в котором описаны что, где, куда нужно качать. Посмотрим на примере устройства Lenovo Z5s aka jd2019
uk: Вони знаходяться в `.repo/local_manifests/`. Може виникнути питання «навіщо це нам потрібно?» Все просто, вам не потрібно вводити купу команд, щоб завантажити кілька репо для себе, а просто помістити файл .xml, який описує, що, де і де скачати. Давайте розглянемо приклад пристрою Lenovo Z5s він же jd2019

source: Что мы тут видим? Обычную xml-структуру. Для сборки jd2019 нам требуется больше 3 репозиториев. Для начала определяем откуда качать.
uk: Що ми тут бачимо? Звичайна структура xml. Нам потрібно більше 3 репо для побудови jd2019. Спочатку визначаємо, звідки завантажувати.

source: Это так называемый `remote`. В нашем случае у нас два remote, ссылка на GitLab и GitHub. Они введут на организацию в GitLab и обычного пользователя на GitHub.
uk: Це так званий `remote`. У нашому випадку у нас два remote, посилання на GitLab і GitHub. Вони введуть на організацію в GitLab і звичайного користувача на GitHub.

source: Дальше указываем что скачиваем.
uk: Далі вказуємо, що ми завантажуємо.

source: Рассмотрим подробнее xml структуру манифеста,
uk: Давайте докладніше розглянемо структуру маніфесту,

source: **name** - Название репозитория в GitHub/GitLab
uk: **name** - Назва репозиторію в GitHub/GitLab

source: **path** - Путь, куда необходимо скачать на диск
uk: **path** - шлях, куди ви хочете завантажити на диск

source: **remote** - Откуда качать репозиторий
uk: **remote** - Звідки качати репозиторій

source: **revision** - Ветка в репозитории, можно не указывать (будет качать ветку по-умолчанию)
uk: **revision** - Гілка в репозиторії, можна не вказувати (буде качати гілку за замовчуванням)

source: В итоге сохранил этот .xml файл как `.repo/local_manifests/jd2019.xml`
uk: У підсумку зберіг цей .xml файл як `.repo/local_manifests/jd2019.xml`

source: Как использовать этот файл? Просто пишем `repo sync` и он будет скачивать наши репозитори вместе с исходниками прошивки и конечно же будет обновить исходники.
uk: Як використовувати цей файл? Просто пишемо `repo sync` і він скачуватиме наші репозиторії разом із вихідними кодами прошивки і, звісно ж, буде оновлювати вихідні коди.

source: Параграф 4: Исходники устройства
uk: Параграф 4: Вихідні коди пристрою

source: Что ж, приступаем к самому интересному. Нам требуется скачать исходники устройства. Рассмотрим два случая: устройство официально поддерживается командой Lineage OS и устройство не поддерживается официально командой Lineage OS.
uk: Що ж, приступаємо до найцікавішого. Нам потрібно завантажити вихідні коди пристрою. Розглянемо два випадки: пристрій офіційно підтримується командою Lineage OS і пристрій не підтримується офіційно командою Lineage OS.

source: **Примечание.** В [предыдушем параграфе](../Chapter1/c1p3.md) мы немного затронули про локальный манифест
uk: **Примітка.** У [попередньому параграфі](../Chapter1/c1p3.md) ми трохи торкнулися про локальний маніфест

source: Устройство официально поддерживается
uk: Пристрій офіційно підтримується

source: Тут самое банальное. Надо только скачать проприетарные библиотеки из репозитория github.com/TheMuppets, где библиотеки раскиданы по производителям. Скажем, у нас смартфон производства LeEco. В поиске вбиваем leeco. Открываем репозиторий, копируем ссылку. Очевидно она будет выглядить так:
uk: Тут найбанальніше. Треба тільки завантажити пропрієтарні бібліотеки з репозиторію github.com/TheMuppets, де бібліотеки розкидані за виробниками. Скажімо, у нас смартфон виробництва LeEco. У пошуку вбиваємо leeco. Відкриваємо репозиторій, копіюємо посилання. Очевидно воно матиме такий вигляд:

source: Так как мы собираем Lineage OS 17.1, то нам нужно скачать ветку lineage-17.1. Что ж, давайте сделаем это! Вводим следующую команду в корне исходников прошивки:
uk: Оскільки ми збираємо Lineage OS 17.1, то нам потрібно завантажити гілку lineage-17.1. Що ж, давайте зробимо це! Вводимо таку команду в корені вихідних кодів прошивки:

source: Давайте разберемся, что мы ввели:
uk: Давайте розберемося, що ми ввели:

source: `git clone` - команда на скачивание репозитория
uk: `git clone` - команда для завантаження репозиторію

source: `https://github.com/TheMuppets/proprietary_vendor_leeco` - ссылка на репозиторий
uk: `https://github.com/TheMuppets/proprietary_vendor_leeco` - посилання на репозиторій

source: `-b lineage-17.1` - указываем ветку, которую требуется скачать
uk: `-b lineage-17.1` - вказуємо гілку, яку потрібно завантажити

source: `vendor/leeco` - путь, куда требуется скачать репозиторий
uk: `vendor/leeco` - шлях, куди потрібно завантажити репозиторій

source: Внимание, если Ваше устройство производства Xiaomi, то скачать проприетарные библиотеки можно из gitlab.com/the-muppets.
uk: Увага, якщо Ваш пристрій виробництва Xiaomi, то завантажити пропрієтарні бібліотеки можна з gitlab.com/the-muppets.

source: Устройство официально не поддерживается
uk: Пристрій офіційно не підтримується

source: И так, самая первая прошивка, которую собирают на новое устройство, это Lineage OS. Во всяком случае, обычно. Будем полагаться на удачу. Так что открываем github.com и в поиск вбиваем
uk: І так, найперша прошивка, яку збирають на новий пристрій, це Lineage OS. У всякому разі, зазвичай. Будемо покладатися на удачу. Тож відкриваємо github.com і в пошук вбиваємо

source: К примеру, давайте найдем исходники Xiaomi Redmi Note 4X - mido. Вводим `device_xiaomi_mido`, видим n-ое количество репозиториев:
uk: Наприклад, давайте знайдемо вихідні коди Xiaomi Redmi Note 4X - mido. Вводимо `device_xiaomi_mido`, бачимо n-ну кількість репозиторіїв:

source: Самое верхнее - дерево от Lineage OS, однако там дерево максимум для Lineage OS 16.0. Не подходит. Смотрим дальше. Есть дерево от Zeelog’а, у него есть дерево для Lineage OS 17.1. Отлично! Берем. Скачиваем по той же схеме, что и библиотеки в примере с устройством LeEco.
uk: Найвище - дерево від Lineage OS, однак там дерево максимум для Lineage OS 16.0. Не підходить. Дивимося далі. Є дерево від Zeelog'а, у нього є дерево для Lineage OS 17.1. Чудово! Беремо. Завантажуємо за тією ж схемою, що й бібліотеки в прикладі з пристроєм Leeco.

source: **Примечание**. Ветка lineage-17.1-4.9 предназначена для сборки Lineage OS 17.1 с ядром 4.9. Ветка lineage-17.1 предназначена для сборки Lineage OS 17.1 с ядром 3.18. (Это в случае с mido!)
uk: **Примітка**. Гілка lineage-17.1-4.9 призначена для складання Lineage OS 17.1 з ядром 4.9. Гілка lineage-17.1 призначена для складання Lineage OS 17.1 з ядром 3.18. (Це у випадку з mido!)

source: Так-с, specific дерево скачали. По идее, если есть lineage.dependencies, то система при инициализации должна подтянуть необходимые исходники. Но так как автор любит все делать ручками, не везде такое работает и в принципе мы учимся, поэтому открываем этот файл и смотрим:
uk: Так-с, specific дерево завантажили. За ідеєю, якщо є lineage.dependencies, то система під час ініціалізації має підтягнути необхідні вихідні коди. Але оскільки автор любить все робити ручками, не скрізь таке працює і в принципі ми вчимося, тому відкриваємо цей файл і дивимося:

source: В случае mido здесь мы видим только ядро. Искать его не надо, открываем профиль Zeelog’а и в поиск вбиваем `android_kernel_xiaomi_mido`. Уже по налаженной схеме клонируем его. Куда клонировать? Можно посмотреть в `lineage.dependencies`. Хотя Вы наверняка заметили некоторую тенденцию в названии репозиториев и куда они были клонированы. Вернемся к тому же ядру, android\_**kernel_xiaomi_mido** - **kernel/xiaomi/mido**. Думаю, вопросы излишни.
uk: У випадку з mido тут ми бачимо тільки ядро. Шукати його не треба, відкриваємо профіль Zeelog'а і в пошук вбиваємо `android_kernel_xiaomi_mido`. Уже за налагодженою схемою клонуємо його. Куди клонувати? Можна подивитися в `lineage.dependencies`. Хоча Ви напевно помітили деяку тенденцію в назві репозиторіїв і куди вони були клоновані. Повернемося до того ж ядра, android_**kernel_xiaomi_mido** - **kernel/xiaomi/mido**. Думаю, питання зайві.

source: Теперь надо скачать проприетарные библиотеки. К сожалению, в `lineage.dependencies` они не прописаны. Открываем профиль Zeelog’а снова и ищем что-то типа `vendor_xiaomi`. Нашли? Отлично, клонируем в соответствующую папку из нужной ветки. Однако если Вы работаете с другим устройством, у вас может быть иначе, к примеру, репозиторий называется `proprietary_vendor_lenovo_A6020`, очевидно, что клонируем в `vendor/lenovo/A6020`. И если в `lineage.dependencies` есть еще что-то, то тоже клонируем в соответствующие папки.
uk: Тепер треба завантажити пропрієтарні бібліотеки. На жаль, в `lineage.dependencies` вони не вказані. Відкриваємо профіль Zeelog'а знову і шукаємо щось на кшталт `vendor_xiaomi`. Знайшли? Чудово, клонуємо у відповідну папку з потрібної гілки. Однак якщо Ви працюєте з іншим пристроєм, у вас може бути інакше, наприклад, репозиторій називається `proprietary_vendor_lenovo_A6020`, очевидно, що клонуємо в `vendor/lenovo/A6020`. І якщо в `lineage.dependencies` є ще щось, то також клонуємо у відповідні папки.

source: Вообще, если есть возможность, то лучше поспрашивать у других сборщиков под ВАШЕ устройство что и откуда скачать для сборки прошивки. В некоторых случаях нужно и вовсе патчить исходники прошивки. К примеру, для моего Asus Zenfone 2 Laser ZE500KL (Z00ED) требуется модифицировать HAL’ы.
uk: Взагалі, якщо є можливість, то краще розпитати в інших збірників під ВАШ пристрій, що і звідки завантажити для збірки прошивки. У деяких випадках потрібно взагалі патчити вихідні коди прошивки. Наприклад, для мого Asus Zenfone 2 Laser ZE500KL (Z00ED) потрібно модифікувати HAL'и.

source: Исходники готовы к сборке под устройство. Приступаем к самой долгой и нудной части - сборке прошивки.
uk: Вихідні коди готові до збірки під пристрій. Переходимо до найдовшої і найнуднішої частини - збірки прошивки.

source: Параграф 5: Инициализация и сборка
uk: Параграф 5: Ініціалізація та збірка

source: И вот мы переходим к самому ~~интересному~~, страшному и интригующему в этой главе - к сборке готовой прошивки!
uk: І ось ми переходимо до най~~цікавішого~~, найстрашнішого та найінтригуючішого в цій главі - до збірки готової прошивки!

source: Для начала требуется настроить окружение, что происходит посредством запуска скрипта build/envsetup.sh. Тут уместна шутка “есть два типа людей”:
uk: Для початку потрібно налаштувати середовище, що виконується за допомогою запуску скрипта build/envsetup.sh. Тут доречний жарт "є два типи людей":

source: Да, это два варианта как запустить скрипт. Автор данного текста относит себя к первому типу людей.
uk: Так, це два варіанти того, як запустити скрипт. Автор цього тексту відносить себе до першого типу людей.

source: Окей, теперь требуется указать системе сборки под какое устройство происходит сборка. Команда должна быть следующей:
uk: Окей, тепер потрібно вказати системі збірки під який пристрій відбувається збірка. Команда має бути такою:

source: **Примечание!** Можно ввести команду `lunch` без каких-то либо аргументов и он выведет вам списко всех устройств, которых нашел. Там может быть под эмулятор Android для Android Studio, официальные устройства и под ваше устройство, если вы правильно все сделали, но рекомендую делать как выше, меньше проблем и быстрее
uk: **Примітка!** Можна ввести команду `lunch` без якихось аргументів і він виведе вам список усіх пристроїв, яких знайшов. Там може бути під емулятор Android для Android Studio, офіційні пристрої і під ваш пристрій, якщо ви правильно все зробили, але рекомендую робити як вище, менше проблем і швидше

source: Где `codename` - кодовое название устройства. Не боимся, сидим и ждем, когда сделает все, что требуется системе сборки.
uk: Де `codename` - кодова назва пристрою. Не боїмося, сидимо і чекаємо, коли зробить усе, що потрібно системі збірки.

source: Отлично! Мы можем почитать почти всю информацию об устройстве, на которое собираем прошивку, и немного об ОС, которая стоит на машине для сборки. Теперь мы готовы собирать. И тут снова 2 варианта:
uk: Чудово! Ми можемо почитати майже всю інформацію про пристрій, на який збираємо прошивку, і трохи про ОС, яка стоїть на машині для збірки. Тепер ми готові збирати. І тут знову 2 варіанти:

source: Сборка прошивки с использованием make и количеством потоков. Если не указывать количество потоков, то сборка будет происходить в однопоточном режиме
uk: Збірка прошивки з використанням make і кількістю потоків. Якщо не вказувати кількість потоків, то збірка відбуватиметься в однопотоковому режимі

source: Сборка прошивки с использованием mka, он автоматически установит нужное количество потоков для сборки
uk: Збірка прошивки з використанням mka, він автоматично встановить потрібну кількість потоків для збірки

source: В чем разница? Об этом нам скажет
uk: У чому різниця? Про це нам скаже

source: с 4PDA:
uk: з 4PDA:

source: **mka** - лучшая команда для сборки в плане качества, т.к использует программу sched_tool, при сборке будет возникать меньше ошибок, выбирает для каждой части сборки подходящий компилятор, но при этом сборка проходит на несколько часов дольше, в зависимости от ТХ вашего ПК или ноутбука, также его называют “супер-заряженной” версией make.
uk: **mka** - найкраща команда для збірки в плані якості, тому що використовує програму sched_tool, під час збірки буде виникати менше помилок, обирає для кожної частини збірки підходящий компілятор, але водночас збірка відбувається на кілька годин довше, залежно від ТХ вашого ПК або ноутбука, також її називають "супер-зарядженою" версією make.

source: Параграф 6: В завершение
uk: Параграф 6: На завершення

source: В принципе Вы научились собирать прошивку, поздравляю! Однако этого будет маловато для ваших целей, не так ли? Всегда хочется собрать что-то другое, что еще на ваш любимый девайс еще не запилили. А может вашу любимую прошивку давно не обновляли и не добавили свежие фиксы для устройства и новые фичи по типу Dirac? Если я не угадал, то это забавно вышло :) Но я уверен, Вам мало просто сборки, Вы хотите чем-то выразиться среди толпы. Надеюсь, что именно здесь мы научим Вас основам.
uk: В цілому Ви навчилися збирати прошивку, вітаю! Однак цього буде замало для ваших цілей, чи не так? Завжди хочеться зібрати щось інше, що на ваш улюблений девайс ще не запилили. А може вашу улюблену прошивку давно не оновлювали і не додали свіжі фікси для пристрою та нові фічі на кшталт Dirac? Якщо я не вгадав, то це кумедно вийшло :) Але я впевнений, Вам мало просто збірки, Ви хочете чимось виразитися серед натовпу. Сподіваюся, що саме тут ми навчимо Вас основ.

source: Ваши учителя:
uk: Ваші вчителі:

source: Книга в данный момент времени в разработке. Если Вы уже человек с опытом и хотите поделиться своими знаниями, то Welcome to the club!
uk: Книжка наразі перебуває в розробці. Якщо Ви вже людина з досвідом і хочете поділитися своїми знаннями, то Welcome to the club!

source: Репозиторий книги
uk: Репозиторій книги

source: Начнем с определения “git”.
uk: Розпочнемо з визначення "git".

source: Git - распределенная система управления версиями.
uk: Git - це розподілена система управління версіями.

source: © Wikipedia
uk: © Вікіпедія

source: По факту git позволяет создавать историю изменений и манипулировать ею, тем самым достигая возможности более быстро разбираться в проблеме, анализировать код и т. д. Без знаний git’а будет очень сложно работать с исходниками Android и в принципе в программировании, ибо инструмент ходовой и бесплатный (если Вы пользовались Mercurial’ом, то скорее всего будет просто освоить git) и очень полезный. Пренебрегать им нельзя ни в коем случае!
uk: Фактично git дає змогу створювати історію змін і маніпулювати нею, у такий спосіб досягаючи можливості швидше розбиратися в проблемі, аналізувати код тощо. Без знань git'а буде дуже складно працювати з вихідними кодами Android і в принципі в програмуванні, бо інструмент ходовий і безоплатний (якщо Ви користувалися Mercurial'ом, то скоріш за все вам легко дасться освоїти git) та дуже корисний. Нехтувати ним не можна в жодному разі!

source: Про название коммитов в дереве устройства и в вендоре. Обычно они имеют такие название:
uk: Про назву комітів у дереві пристрою та у вендорі. Зазвичай вони мають такі назви:

source: “codename: part_of_tree: Name” (пример: “mido: mixer_paths: Remove duplicate entries”);
uk: “codename: part_of_tree: Name” (приклад: “mido: mixer_paths: Remove duplicate entries”);

source: “codename: Name” (пример: “mido: Kang tissot s5k5e8_ofilm”);
uk: “codename: Name” (приклад: “mido: Kang tissot s5k5e8_ofilm”);

source: “part_of_tree: Name” (пример: “power: Handle Mode::LAUNCH power hints”).
uk: “part_of_tree: Name” (приклад: “power: Handle Mode::LAUNCH power hints”).

source: В принципе и все, едем к основной части!
uk: У принципі це все, рушаємо до основної частини!

source: Параграф 1: Создание аккаунта на GitHub и настройка git под свой аккаунт
uk: Параграф 1: Створення акаунта на GitHub, налаштування git під свій акаунт

source: Хочу сказать, что если Вы имеете аккаунт на GitHub или чем-то подобном и знаете git, то это глава Вам не нужна, ибо Вы и так все знаете.
uk: Хочу сказати, що якщо Ви маєте акаунт на GitHub або в чомусь подібному і знаєте git, то цей розділ Вам не потрібен, адже Ви і так все знаєте.

source: Создаем аккаунт на GitHub
uk: Створюємо акаунт на GitHub

source: Тут в принципе ничего сложного, просто идем на
uk: В принципі, нічого складного тут немає, просто перейдіть до

source: , вводим почту и пароль, входим, вуаля, у нас есть аккаунт на GitHub. Здесь мы можем создавать свои репозитории, в том числе и приватные, оценить чей-то репозиторий, подписаться на обновления репозитория, подписаться на человека, искать какие-то репозитории, поставить аватарку и статус :)
uk: , введіть свою електронну пошту та пароль, увійдіть, вуаля, у нас є обліковий запис GitHub. Тут ми можемо створювати власні репозиторії, в тому числі приватні, оцінювати чийсь репозиторій, підписатися на оновлення репозиторіїв, підписатися на людину, шукати якісь репозиторії, ставити аватар і статус :)

source: Перейдем к тому, чтобы наши коммиты (commits) и черри-пики (cherry-picks) имели информацию о нас.
uk: Перейдемо до того, щоб наші коміти (commits) і чері-піки (cherry-picks) мали інформацію про нас.

source: И так, варианта два и они различаются лишь флагом `--global`, который говорит, что информация о нас будет использоваться везде по умолчанию.
uk: І так, варіантів два і вони різняться лише прапором `--global`, який говорить, що інформація про нас буде використовуватися скрізь за замовчуванням.

source: Пример глобальной настройки пользователя
uk: Приклад глобального налаштування користувача

source: Оригинал
uk: Оригінал

source: , откуда взят пример
uk: , звідки взявся приклад

source: `user.name` это никнейм вашего GitHub аккаунта, а `user.email` - почта, которую Вы использовали при регистрации на GitHub.
uk: `user.name` - це нікнейм вашого GitHub акаунта, а `user.email` - пошта, яку Ви використовували під час реєстрації на GitHub.

source: Параграф 2: Ходовые команды git’а
uk: Параграф 2: Ходові команди git'у

source: Здесь приведены не все команды, только необходимая база, которой я обычно пользуюсь. Для чего-то специфического вперед в Google или в любой другой поисковик.
uk: Тут наведено не всі команди, лише необхідна база, якою я зазвичай користуюся. Для чогось специфічного вперед у Google або в будь-який інший пошуковик.

source: Это переключение между бранчами.
uk: Це перехід між бранчами.

source: Это команда для скачивания репозитория по ссылке url из ветки branch (требуется флаг -b перед названием ветки) в папку path/to/folder. Ветка и папка являются необязательными аргументами.
uk: Це команда для завантаження репозиторію з посилання url з гілки branch (перед назвою гілки потрібно прапорець -b) в папку path/to/folder. Гілка і папка є необов'язковими аргументами.

source: Это добавление кастомного имени для репозитория. Используется в последующем для скачивания данных с указанного репозитория.
uk: Це додавання кастомного імені для репозиторію. Використовується в подальшому для скачування даних із зазначеного репозиторію.

source: Это скачивание данных (коммитов) с репозитория по ссылке url или с репозитория, который имеет кастомное название. Тут между этими вариантами есть разница. Если чисто по ссылке, то он скачает данные только о главной ветке и они сотрутся после скачивания данных с другой ссылки. Второй вариант скачает информацию со всех бранчей и сохранит ее. Той же командой ее можно и обновить.
uk: Це скачування даних (комітів) з репозиторію за посиланням url або з репозиторію, який має кастомну назву. Тут між цими варіантами є різниця. Якщо суто за посиланням, то він завантажить дані тільки про головну гілку, і вони зітруться після скачування даних з іншого посилання. Другий варіант завантажить інформацію з усіх бранчів і збереже її. Тією ж командою її можна й оновити.

source: Это автоматизированная версия git fetch. Он загружает бранч из удаленного репозитория, а затем объединяет ее с текущим.
uk: Це автоматизована версія git fetch. Він завантажує бранч з віддаленого репозіторія, а потім об'єднує його з поточним.

source: Это противоположность fetch (с некоторыми оговорками). Он позволяет вам переместить локальную ветвь в другой репозиторий, что служит удобным способом публикации коммитов.
uk: Це протилежність fetch (з деякими застереженнями). Він дає змогу вам перемістити локальну гілку в інше репозиторій, що слугує зручним способом публікації комітів.
