Repository: CakesTwix/translating-BookAboutBuilding
Catalog: po/*.po
Languages: uk

source: `-` - если блоб является модулем, и требуется что-то собрать с использованием этого блоба, [пример](https://github.com/LineageOS/android_device_leeco_s2/blob/1c12856e5c8d70e756aa48f91d1ad9066ddd9fd0/audio_amplifier/Android.mk#L26)
uk: `-` - якщо блоб є модулем, і потрібно щось зібрати з використанням цього блобу, [приклад](https://github.com/LineageOS/android_device_leeco_s2/blob/1c12856e5c8d70e756aa48f91d1ad9066ddd9fd0/audio_amplifier/Android.mk#L26)

source: `destination` - где будет лежать блоб в готовом vendor'е
uk: `destination` - де лежатиме блоб у готовому vendor`і

source: ### Дампы
uk: ### Дампи

source: # Параграф 5: Обновление и сборка ядра
uk: # Параграф 5: Оновлення та збірка ядра

source: Для обновления ядра, вам нужен хотя бы средний уровень знаний того, как же работает ядро (см. [что такое ядро](https://github.com/Roker2/BookAboutBuilding/blob/master/%D0%93%D0%BB%D0%B0%D0%B2%D0%B0%203%20%D0%B8%D0%B7%D1%83%D1%87%D0%B5%D0%BD%D0%B8%D0%B5%20%D0%B8%D1%81%D1%85%D0%BE%D0%B4%D0%BD%D0%B8%D0%BA%D0%BE%D0%B2%20%D1%83%D1%81%D1%82%D1%80%D0%BE%D0%B9%D1%81%D1%82%D0%B2%D0%B0/%D0%9F%D0%B0%D1%80%D0%B0%D0%B3%D1%80%D0%B0%D1%84%204%20%D0%A7%D1%82%D0%BE%20%D1%82%D0%B0%D0%BA%D0%BE%D0%B5%20%D1%8F%D0%B4%D1%80%D0%BE.md#%D0%BF%D0%B0%D1%80%D0%B0%D0%B3%D1%80%D0%B0%D1%84-4-%D1%87%D1%82%D0%BE-%D1%82%D0%B0%D0%BA%D0%BE%D0%B5-%D1%8F%D0%B4%D1%80%D0%BE)) и в целом Android, а так же умение пользоваться git (см. [ходовые команды git](https://github.com/Roker2/BookAboutBuilding/blob/master/%D0%93%D0%BB%D0%B0%D0%B2%D0%B0%202%20git%2C%20%D1%81%20%D1%87%D0%B5%D0%BC%20%D0%B5%D0%B3%D0%BE%20%D0%B5%D0%B4%D1%8F%D1%82%20%D0%B8%20%D0%B7%D0%B0%D1%87%D0%B5%D0%BC%20%D0%BE%D0%BD/%D0%9F%D0%B0%D1%80%D0%B0%D0%B3%D1%80%D0%B0%D1%84%202%20%D0%A5%D0%BE%D0%B4%D0%BE%D0%B2%D1%8B%D0%B5%20%D0%BA%D0%BE%D0%BC%D0%B0%D0%BD%D0%B4%D1%8B%20git'%D0%B0.md#%D0%BF%D0%B0%D1%80%D0%B0%D0%B3%D1%80%D0%B0%D1%84-2-%D1%85%D0%BE%D0%B4%D0%BE%D0%B2%D1%8B%D0%B5-%D0%BA%D0%BE%D0%BC%D0%B0%D0%BD%D0%B4%D1%8B-git%D0%B0)).
uk: Щоб оновити ядро, потрібен хоча б середній рівень знань про те, як працює ядро (див. [що таке ядро](https://github.com/Roker2/BookAboutBuilding/blob/master/%D0%93%D0%BB%D0%B0%D0%B2%D0%B0%203%20%D0%B8%D0%B7%D1%83%D1%87%D0%B5%D0%BD%D0%B8%D0%B5%20%D0%B8%D1%81%D1%85%D0%BE%D0%B4%D0%BD%D0%B8%D0%BA%D0%BE%D0%B2%20%D1%83%D1%81%D1%82%D1%80%D0%BE%D0%B9%D1%81%D1%82%D0%B2%D0%B0/%D0%9F%D0%B0%D1%80%D0%B0%D0%B3%D1%80%D0%B0%D1%84%204%20%D0%A7%D1%82%D0%BE%20%D1%82%D0%B0%D0%BA%D0%BE%D0%B5%20%D1%8F%D0%B4%D1%80%D0%BE.md#%D0%BF%D0%B0%D1%80%D0%B0%D0%B3%D1%80%D0%B0%D1%84-4-%D1%87%D1%82%D0%BE-%D1%82%D0%B0%D0%BA%D0%BE%D0%B5-%D1%8F%D0%B4%D1%80%D0%BE)) і Андроїд в загальні, а також можливість використовувати git (див. [git running команди](https://github.com/Roker2/BookAboutBuilding/blob/master/%D0%93%D0%BB%D0%B0%D0%B2%D0%B0%202%20git%2C%20%D1%81%20%D1%87%D0%B5%D0%BC%20%D0%B5%D0%B3%D0%BE%20%D0%B5%D0%B4%D1%8F%D1%82%20%D0%B8%20%D0%B7%D0%B0%D1%87%D0%B5%D0%BC%20%D0%BE%D0%BD/%D0%9F%D0%B0%D1%80%D0%B0%D0%B3%D1%80%D0%B0%D1%84%202%20%D0%A5%D0%BE%D0%B4%D0%BE%D0%B2%D1%8B%D0%B5%20%D0%BA%D0%BE%D0%BC%D0%B0%D0%BD%D0%B4%D1%8B%20git'%D0%B0.md#%D0%BF%D0%B0%D1%80%D0%B0%D0%B3%D1%80%D0%B0%D1%84-2-%D1%85%D0%BE%D0%B4%D0%BE%D0%B2%D1%8B%D0%B5-%D0%BA%D0%BE%D0%BC%D0%B0%D0%BD%D0%B4%D1%8B-git%D0%B0)).

source: ## Обновление
uk: ## Оновлення

source: ### Подготовка
uk: ### Підготовка

source: Давайте, для начала узнаем какие стабильные версии ядра Android на данный момент (2022 г.) активно обновляются. Вот список для наглядности: *4.9, 4.14, 4.19, 5.4, 5.10, 5.15*. Должен сразу предупредить, что обновить ядро, предположим, с 4.9 до 4.19 без перебазирования невозможно, более того, обычно производитель делает специфические драйвера устройства только для одной версии и не обновляет дальше, а так же само ядро может не поддерживать ваш чипсет и без углублённых знаний в ядре обновить драйвера у вас не получится. Поэтому, зачастую, маинтейнеры обновляют **sublevel** ядра, это мы и будем делать ниже. Чтобы узнать его, заходим в исходник ядра, которое хотим обновить, в корне находим и открываем файлик **Makefile**, в самом верху (обычно) видим такую картину:
uk: Давайте, для початку дізнаємося, які стабільні версії ядра Android на даний момент (2022 р.) активно оновлюються. Ось список для наочності: *4.9, 4.14, 4.19, 5.4, 5.10, 5.15*. Повинен одразу попередити, що оновити ядро, припустимо, з 4.9 до 4.19 без перебазування неможливо, більше того, зазвичай виробник робить специфічні драйвера пристрою тільки для однієї версії і не оновлює далі, також саме ядро може не підтримувати ваш чіпсет, і без поглиблених знань у ядрі оновити драйвера у вас не вийде. Тому, найчастіше, маінтейнери оновлюють **sublevel** ядра, це ми і будемо робити нижче. Щоб дізнатися його, заходимо у вихідник ядра, яке хочемо оновити, у корені знаходимо і відкриваємо файлик **Makefile**, у самому верху (зазвичай) бачимо таку картину:

source: > *Либо просто заходим на своём смартфоне в Настройки > О Телефоне (только если на смартфоне установлено то же ядро, исходники которого вы собираететсь обновить*)
uk: > *Або просто заходимо на своєму смартфоні в Налаштування > Про Телефон (тільки якщо на смартфоні встановлено те саме ядро, вихідні коди якого ви збираєтеся оновити*)

source: ### Скачиваем репозитории
uk: ### Завантажуємо репозиторії

source: Для примера, я буду использовать [4.9.268](https://github.com/PixelExperience-Devices/kernel_lenovo_sdm710/tree/81bad83b39681cc137d99a1b613839032dab9184) ядро от Lenovo Z5s (jd2019) и обновлю его до [4.9.319](https://github.com/PixelExperience-Devices/kernel_lenovo_sdm710/tree/76e4fbb527d37378bac0a982c3df9551f17dbfe7). Также, для удобства, рекомендую использовать [GitHub Desktop](https://github.com/shiftkey/desktop), хоть в нём и не присутствует весь функционал.
uk: Для прикладу, я буду використовувати [4.9.268](https://github.com/PixelExperience-Devices/kernel_lenovo_sdm710/tree/81bad83b39681cc137d99a1b613839032dab9184) ядро від Lenovo Z5s (jd2019) і оновлю його до [4.9.319](https://github.com/PixelExperience-Devices/kernel_lenovo_sdm710/tree/76e4fbb527d37378bac0a982c3df9551f17dbfe7). Також, для зручності, рекомендую використовувати [GitHub Desktop](https://github.com/shiftkey/desktop), хоч у ньому і не присутній весь функціонал.

source: 1. Для начала нам нужно склонировать исходники своего ядра (описывать как это делать я думаю не нужно), после добавляем репозиторий в GitHub Desktop (опять же, это не обязательно, все действия можно выполнить только через git). 2. Затем, открываем терминал в папке с исходниками вашего ядра и добавляем наш удаленный репозиторий общего ядра командой: ```bash git remote add common url ``` `common` - название, можете использовать любое другое `url` - ссылка на репозиторий 3. Теперь фетчим добавленный репозиторий: ```bash git fetch common ``` > *Если вам лень или не позволяет интернет скачать весь репозиторий, можете в конце команды добавить название бранча, тогда скачивать будет только его.*
uk: 1. Для початку нам потрібно склонувати вихідні коди свого ядра (описувати, як це робити, я думаю, не потрібно), після цього додаємо репозиторій до GitHub Desktop (знову ж таки, це не обов'язково, всі дії можна виконати тільки через git). 2. Потім, відкриваємо термінал у папці з вихідними кодами вашого ядра і додаємо наш віддалений репозиторій загального ядра командою: ```bash git remote add common url ``` `common` - назва, можете використовувати будь-яку іншу `url` - посилання на репозиторій 3. тепер фетчимо доданий репозиторій: ```bash git fetch common ``` > *Якщо вам ліньки або не дозволяє інтернет завантажити весь репозиторій, можете наприкінці команди додати назву бранча, тоді завантажувати буде тільки його.*

source: [картинка с списком бранчей]
uk: [картинка зі списком бранчів]

source: ### Мержим изменения
uk: ### Мержим зміни

source: 1. Находим нужную нам версию с помощью поиска в разделе тэгов: ![4](images/4.png) 2. Копируем SHA и мержим этот коммит в нашем бранче: ```bash git merge sha ``` > Если никаких конфликтов нет, то можете замержить ещё пару. Но опять же, вы не будете знать на какой версии у вас всё поломалось, так что лучше мержить по одному-два и собирать, если ядро собралось и система запустилась, то переходим к следующим саблевелам.
uk: 1. Знаходимо потрібну нам версію за допомогою пошуку в розділі тегів: ![4](images/4.png) 2. Копіюємо SHA і мержимо цей коміт у нашому бранчі: ```bash git merge sha ``` > Якщо жодних конфліктів немає, то можете замержити ще пару. Але знову ж таки, ви не знатимете, на якій версії у вас все поламалося, тож краще мержити по одному-два і збирати, якщо ядро зібралося і система запустилася, то переходимо до наступних саблевелів.

source: ### Фиксим конфликты
uk: ### Фіксимо конфлікти

source: ## Сборка ядра
uk: ## Збірка ядра

source: ### Из исходников прошивки
uk: ### З вихідних кодів прошивки

source: ### Из папки ядра
uk: ### З папки ядра

source: 1. Скачайте исходный код ядра Android и перейдите в папку с ним с помощью команды: ```bash git clone <url> kernel ``` ```bash cd kernel ``` 2. Убедитесь, что у вас установлены необходимые инструменты для сборки ядра, такие как компилятор GCC/Clang, библиотека make, инструменты для работы с архивами (tar, gzip и т.д.) и другие. 3. Выберите конфигурацию ядра, которую хотите собрать: ```bash make defconfig ``` > Эта команда создаст файл конфигурации ядра с набором опций по умолчанию. Конечно же, выбираете свой defconfig ```bash make menuconfig ``` > Эта команда откроет интерактивное меню, где вы сможете выбрать нужные опции ядра с помощью стрелочек. 4. Запустите сборку ядра с помощью команды: ```bash make -jN ``` > Где N - это количество ядер вашего процессора. Это позволит ускорить сборку, так как она будет выполняться параллельно на разных ядрах. 5. После успешной сборки ядро будет доступно в каталоге `arch/architecture/boot/` (где architecture - это архитектура вашего устройства, например, x86 или arm).
uk: 1. Скачайте вихідний код ядра Android і перейдіть у папку з ним за допомогою команди: ```bash git clone <url> kernel ``` ```bash cd kernel ``` 2. Переконайтеся, що у вас встановлені необхідні інструменти для збірки ядра, такі як компілятор GCC/Clang, бібліотека make, інструменти для роботи з архівами (tar, gzip тощо) та інші. 3. Виберіть конфігурацію ядра, яку хочете зібрати: ```bash make defconfig ``` > Ця команда створить файл конфігурації ядра з набором опцій за замовчуванням. Звісно ж, обираєте свій defconfig ```bash make menuconfig ``` > Ця команда відкриє інтерактивне меню, де ви зможете вибрати потрібні опції ядра за допомогою стрілок. 4. Запустіть збірку ядра за допомогою команди: ```bash make -jN ``` > Де N - це кількість ядер вашого процесора. Це дасть змогу прискорити збірку, оскільки вона виконуватиметься паралельно на різних ядрах. 5. Після успішної збірки ядро буде доступне в каталозі `arch/architecture/boot/` (де architecture - це архітектура вашого пристрою, наприклад, x86 або arm).

source: # Параграф 1: ошибки сборки (SELinux, нехватка пакетов, ресурсов и тд)
uk: # Параграф 1: Помилки збірки (SELinux, брак пакетів, ресурсів тощо)

source: ## Cписок частых ошибок:
uk: ## Список найчастіших помилок:

source: > Фикс: > > 1. Создаём папку по пути /mnt/ccache командой: > ```bash > sudo mkdir /mnt/ccache > ``` > 2. Монтируем cache: > ```bash > sudo mount --bind /home/username/.cache /mnt/ccache > ``` > *Вместо "username" вписываете своего юзера! И не ошибитесь в пути, у вас он может быть слегка другим.* > > 3. После монтирования прописываем команду для сжатия нашего кэша (это опционально, если вы хотите впихнуть больше в мелкий объём как я, то пишем): > ```bash > ccache -o compression=true > ``` > 4. Делаем стандартный экспорт и т.д.: > ```bash > export USE_CCACHE=1 > ``` > ```bash > export CCACHE_EXEC=/usr/bin/ccache > ``` > ```bash > export CCACHE_DIR=/mnt/ccache > ``` > 5. Устанавливаем размер нашего кэша: > ```bash > ccache -M 15G -F 0 > ``` > *15G - Размер кэша в ГБ* > > 5.1. **Такое решение работает до первой перезагрузки.** Для повторного исправления (после каждого ребута), просто прописываете команду монтирования: > ```bash > sudo mount --bind /home/username/.cache /mnt/ccache > ``` > 6. Либо добавляем наш ccache в fstab: > ```bash > sudo nano /etc/fstab > ``` > 6.1. И добавляем строку: > `/home/username/ccache /mnt/ccache none defaults,bind,users,noauto 0 0` > > 8. После чего редактируем файл профиля: > ```bash > nano ~/.profile > ``` > 7.1. Добавив строку: > ```bash > mount /mnt/ccache > ```
uk: > Фікс: > > 1. Створюємо папку за шляхом /mnt/ccache командою: > ```bash > sudo mkdir /mnt/ccache > ``` > 2. Монтуємо cache: > ```bash > sudo mount --bind /home/username/.cache /mnt/ccache > ``` > *Замість "username" вписуєте свого юзера! І не помиліться в шляху, у вас він може бути дещо іншим. > > 3. Після монтування прописуємо команду для стиснення нашого кешу (це опціонально, якщо ви хочете впихнути більше в дрібний обсяг як я, то пишемо): > ```bash > ccache -o compression=true > ``` > 4. Робимо стандартний експорт і т.д.: > ```bash > export USE_CCACHE=1 > ``` > ```bash > export CCACHE_EXEC=/usr/bin/ccache > ``` > ```bash > export CCACHE_DIR=/mnt/ccache > ``` > 5. Встановлюємо розмір нашого кешу: > ```bash > ccache -M 15G -F 0 > ``` > *15G - Розмір кешу в ГБ*. > > 5.1. **Таке рішення працює до першого перезавантаження.** Для повторного виправлення (після кожного ребуту), просто прописуєте команду монтування: > ```bash > sudo mount --bind /home/username/.cache /mnt/ccache > ``` > 6. Або додаємо наш ccache у fstab: > ```bash > sudo nano /etc/fstab > ``` > 6.1. І додаємо рядок: > `/home/username/ccache /mnt/ccache none defaults,bind,users,noauto 0 0` > > 8. Після чого редагуємо файл профілю: > ```bash > nano ~/.profile > ``` > 7.1. Додавши рядок: > ```bash > mount /mnt/ccache > ```

source: > Фикс: > > - Ubuntu > > ```bash > sudo apt-get install libncurses5 > ``` > > - Arch > > ```bash > yay ncurses5-compat-libs > ```
uk: > Фікс: > > - Ubuntu > > ```bash > sudo apt-get install libncurses5 > ``` > > - Arch > > ```bash > yay ncurses5-compat-libs > ```

source: > Фикс: > > **Android 10** *(возможно устарело)* > > 1) Заходим в папку build/soong: > > ```bash > cd build/soong > ``` > > 2) Открываем на Lineage OS Gerrit нужный нам [коммит](https://review.lineageos.org/c/LineageOS/android_build_soong/+/266411) > > 3) Нажимаем кнопку "`DOWNLOAD`" > > ![image-20210528014449000](images/2.png) > > 4) Напротив варианта "`Cherry Pick`" нажимаем кнопку копирования > > ![image-20210528014553371](images/3.png) > > 5) Копируем в терминал и нажимаем Enter > > 6) Возвращаемся в корень исходников: > > ```bash > cd ../.. > ``` > > 7) Выполняем все подготовительные команды для сборки, но не запускаем > > 8) Заранее и отдельно собираем по одному компоненту, который требует много ОЗУ: > > ```bash > mka api-stubs-docs && mka hiddenapi-lists-docs && mka system-api-stubs-docs && mka test-api-stubs-docs > ``` > > 9) Запускаем сборку прошивки > > [Референс](https://gist.github.com/mikecriggs/d98f2fc3461b23732fabebb020e4c42e) > > > > **Android 11-13** > > Для него все тоже самое, отличие только в [коммите](https://github.com/verNANDo57/android_build_soong/commit/ffc8846a01fcfc20d6cf8ca701ef73d99f15acad) и какие компоненты собираем заранее. > > ```bash > mka api-stubs-docs && mka module-lib-api-stubs-docs && mka system-api-stubs-docs && mka test-api-stubs-docs > ``` > > [Референс](https://gist.github.com/verNANDo57/d76bb6e6e4b887101cf5a1cf64c66cef)
uk: > Фікс: > > **Android 10** *(можливо застаріло)* > > 1) Заходимо в папку build/soong: > > ```bash > cd build/soong > ``` > > 2) Відкриваємо на Lineage OS Gerrit потрібний нам [коміт](https://review.lineageos.org/c/LineageOS/android_build_soong/+/266411) > > 3) Натискаємо кнопку "`DOWNLOAD`" > > ![image-20210528014449000](images/2.png) > > 4) Навпроти варіанта "`Cherry Pick`" натискаємо кнопку копіювання > > ![image-20210528014553371](images/3.png) > > 5) Копіюємо в термінал і натискаємо Enter > > 6) Повертаємося в корінь вихідних кодів: > > ```bash > cd ../... > ``` > > 7) Виконуємо всі підготовчі команди для збірки, але не запускаємо > > 8) Заздалегідь та окремо збираємо по одному компоненту, який потребує багато ОЗП: > > ```bash > mka api-stubs-docs && mka hiddenapi-lists-docs && mka system-api-stubs-docs && mka test-api-stubs-docs > ``` > > 9) Запускаємо збірку прошивки > > [Референс](https://gist.github.com/mikecriggs/d98f2fc3461b23732fabebb020e4c42e) > > > > **Android 11-13** > > Для нього все те саме, відмінність тільки в [комміті](https://github.com/verNANDo57/android_build_soong/commit/ffc8846a01fcfc20d6cf8ca701ef73d99f15acad) і які компоненти збираємо заздалегідь. > > ```bash > mka api-stubs-docs && mka module-lib-api-stubs-docs && mka system-api-stubs-docs && mka test-api-stubs-docs > ``` > > [Референс](https://gist.github.com/verNANDo57/d76bb6e6e4b887101cf5a1cf64c66cef)

source: > Фикс: > > ​ Убрать русские буквы в пути. Не должно быть по типу /home/coolgirl/прошивочка/...
uk: > Фікс: > > Прибрати кириллицю в шляху. Не повинно бути на кшталт /home/coolgirl/прошивочка/...

source: # Список полезных утилит и приложений
uk: # Список корисних утиліт і додатків

source: * [GitHub Desktop](https://github.com/shiftkey/desktop) - GUI клиент GitHub для быстрого редактирования репозитория, отсутствуют некоторые важные функции, поэтому работать с консолью все равно придётся * [GitKraken](https://www.gitkraken.com/) - GUI git клиент * Midnight Commander - консольный файловый менеджер, пакет `mc` * [Meld](https://meld.app/) - программа для сравнения файлов, пакет `meld` * nano - консольный текстовый редактор * sed - потоковый текстовый редактор
uk: * [GitHub Desktop](https://github.com/shiftkey/desktop) - GUI клієнт GitHub для швидкого редагування репозиторію, відсутні деякі важливі функції, тому працювати з консоллю все одно доведеться * [GitKraken](https://www.gitkraken.com/) - GUI git клієнт * Midnight Commander - консольний файловий менеджер, пакет `mc` * [Meld](https://meld.app/) - програма для порівняння файлів, пакет `meld` * nano - консольний текстовий редактор * sed - потоковий текстовий редактор
